Vimalananth/STM32-EC200-Firmware/src/modem.c
/* ── RX buffer ──────────────────────────────────────────────────────────── */
#define RX_BUF_SIZE 512

/* ═══════════════════════════════════════════════════════════════════════════
 * Internal state
 * ═══════════════════════════════════════════════════════════════════════════ */

typedef enum
{
    MQTT_STATE_BOOT,         /* waiting for EC200U power-on            */
    MQTT_STATE_NET_WAIT,     /* waiting for network registration       */
    MQTT_STATE_PDP_OPEN,     /* send AT+QICSGP, wait OK               */
    MQTT_STATE_PDP_ACTIVATE, /* send AT+QIACT=1, wait OK              */
    MQTT_STATE_SSL_CFG,      /* configuring SSL for port 8883          */
    MQTT_STATE_BROKER_OPEN,  /* AT+QMTOPEN — TCP to broker             */
    MQTT_STATE_CONNECTING,   /* AT+QMTCONN — MQTT handshake            */
    MQTT_STATE_SUBSCRIBING,  /* AT+QMTSUB  — subscribe to cmd topic    */
    MQTT_STATE_CONNECTED,    /* fully operational                      */
    MQTT_STATE_PUBLISHING,   /* waiting for '>' prompt after PUBEX     */
    MQTT_STATE_PUB_WAIT_OK,  /* waiting for +QMTPUBEX: 0,0,0          */
    MQTT_STATE_DISCONNECTED, /* lost connection — will reconnect       */
} MqttState;

static UART_HandleTypeDef *modem_uart;
static MqttState mqtt_state = MQTT_STATE_BOOT;
static char rxbuf[RX_BUF_SIZE];
static size_t rxpos = 0;
static uint32_t state_entered_ms = 0;

/* relay + protection */
static bool     relay1 = false;
static bool     relay2 = false;
static uint32_t relay1_on_tick = 0;      /* HAL_GetTick() when relay1 last turned ON */
static uint32_t relay2_on_tick = 0;      /* HAL_GetTick() when relay2 last turned ON */
static uint32_t run_accum1_ms = 0;       /* accumulated confirmed-running time for relay1 (ms) */
static uint32_t run_accum2_ms = 0;       /* accumulated confirmed-running time for relay2 (ms) */
static uint32_t last_r1_run_tick = 0;    /* HAL_GetTick() of last run_protection tick where r1 was running */
static uint32_t last_r2_run_tick = 0;    /* HAL_GetTick() of last run_protection tick where r2 was running */
static uint32_t run_accum1_saved_ms = 0; /* run_accum1_ms value at last periodic flash save */
static uint32_t run_accum2_saved_ms = 0; /* run_accum2_ms value at last periodic flash save */
#define RUN_SAVE_INTERVAL_MS 900000UL    /* save run_accum every 15 min while running */

/* ── Network real-time clock (synced via AT+CCLK? after MQTT connect) ────── */
static uint64_t rtc_unix_ms   = 0;     /* UTC Unix time (ms) at rtc_tick_base  */
static uint32_t rtc_tick_base = 0;     /* HAL_GetTick() when rtc_unix_ms set   */
static bool     cclk_needed   = false; /* request sync on next idle MQTT slot  */
static uint32_t last_cclk_ms  = 0;     /* HAL_GetTick() of last CCLK sync      */
#define CCLK_RESYNC_MS  21600000UL     /* re-sync every 6 hours                */

/* SMS remote control */
static bool sms_pending = false; /* +CMTI URC received — read SMS on next process */
static int  sms_index   = -1;   /* SMS storage index from +CMTI: "SM",<idx>       */
static bool volt_alert_sent1 = false;    /* voltage fault alert was published for relay1 */
static bool volt_alert_sent2 = false;    /* voltage fault alert was published for relay2 */
static bool     uv_pl_tripped1 = false;  /* relay1 was tripped by UV/PL (not OV) — eligible for auto-restart */
static bool     uv_pl_tripped2 = false;
static uint32_t uv_cleared_ms1 = 0;     /* HAL_GetTick() when UV/PL first cleared for relay1 */
static uint32_t uv_cleared_ms2 = 0;
static bool recv_payload_pending = false; /* true when +QMTRECV payload on next line */
static char recv_pending_topic[48] = ""; /* topic of pending split-line payload     */
static uint16_t dry_run_count   = 0;   /* uint16 — cfg_dry_t can be up to 600 s */
static bool     dry_run_tripped = false;
static uint32_t lockout_until   = 0;
static uint16_t dry_run_count2  = 0;
static bool     dry_run_tripped2 = false;
static uint32_t lockout_until2  = 0;
/* Overload counters — trip after 3 consecutive 1-s samples above HP-rated limit */
static uint8_t  overload_count1   = 0;
static bool     overload_tripped1 = false;
static uint8_t  overload_count2   = 0;
static bool     overload_tripped2 = false;
/* Voltage hold — require VOLT_TRIP_HOLD_S consecutive fault samples before tripping */
static uint16_t volt_trip_count1  = 0;
static uint16_t volt_trip_count2  = 0;

/* publish queue — one pending payload at a time */
static char pub_topic[48];
static char pub_payload[824];   /* must be >= largest payload (publish_status ~787 B with mains_dur_s) */
static bool pub_pending = false;
/* Exact byte count sent in the last AT+QMTPUBEX command.
 * Used to escape data mode when +QMTSTAT: arrives before '>' is processed:
 * sending these bytes + Ctrl-Z exits EC200U fixed-length data mode cleanly. */
static size_t pub_len_in_flight = 0;

/* OTA error saved here so it survives MQTT reconnect (heartbeat would overwrite pub_pending) */
static char ota_error_msg[80];
static bool force_status_after_ota = false;
/* Deferred pump02 status publish — set true whenever status2 needs sending;
 * processed in the main loop as soon as pub_pending clears.
 * Avoids the drop caused by publish_status() setting pub_pending immediately
 * before publish_status2() is called. */
static bool pub_status2_needed = false;
static bool pub_line2_needed   = false; /* deferred line2_status after keepalive  */
static bool pub_vlog2_needed   = false; /* deferred vlog2 (pump2 voltage log)     */

/* event-driven publish: track previous state to detect changes */
static uint32_t last_heartbeat_ms  = 0;
/* line2 (Blue Pill slave) event tracking */
static int      prev_lora_r3_pub   = -2;   /* -2 = uninitialized; triggers first publish */
static bool     prev_slave_online  = false;
static uint32_t mqtt_offline_since_ms = 0; /* HAL_GetTick() when MQTT left active state; 0=active */

/* ── MQTT offline backoff watchdog ───────────────────────────────────────────
 * Max 3 auto-resets with increasing delays:
 *   reset #1 — 2 minutes offline
 *   reset #2 — 30 minutes offline (on this boot)
 *   reset #3 — 1 hour offline (on this boot)
 * After 3 resets the board waits for manual power cycle.
 * The reset count is stored in RTC BKP0R so it survives NVIC_SystemReset().
 * It is cleared on any non-software reset (power-on, IWDG, pin reset).    */
#define MQTT_WD_MAX_RESETS   3U
static const uint32_t MQTT_WD_DELAY_MS[MQTT_WD_MAX_RESETS] = {
    2UL  * 60UL * 1000UL,   /* reset #1: 2 min  */
    30UL * 60UL * 1000UL,   /* reset #2: 30 min */
    60UL * 60UL * 1000UL,   /* reset #3: 1 hour */
};
