Vimalananth/STM32-EC200-Firmware/src/modem.c
/* Persist reset count across NVIC_SystemReset() using a .noinit RAM variable.
 * The startup code does NOT zero .noinit, so it survives a soft reset.
 * A magic pair validates the contents — cleared by power-on (RAM loses state). */
#define BKUP_MAGIC_A  0xDEADBEEFUL
#define BKUP_MAGIC_B  0xCAFEBABEUL

static uint32_t noinit_magic_a __attribute__((section(".noinit")));
static uint32_t noinit_magic_b __attribute__((section(".noinit")));
static uint8_t  noinit_reset_n __attribute__((section(".noinit")));

/* Relay state saved when MQTT goes offline so it can be restored on reconnect.
 * Stored in .noinit so it survives NVIC_SystemReset() between retry boots.  */
#define OFFLINE_RELAY_MAGIC  0x4F46464CUL   /* "OFFL" */
static uint32_t noinit_offline_magic  __attribute__((section(".noinit")));
static uint8_t  noinit_offline_relay1 __attribute__((section(".noinit")));
static uint8_t  noinit_offline_relay2 __attribute__((section(".noinit")));

/* Mains power-off state — relay restore intent across mains outage + soft reboots.
 * 12V relay coil supply is mains-powered; cannot pulse coil during outage.
 * On mains loss: record which relay was ON so it can be restored when 12V returns. */
#define MAINS_OFF_V       50.0f
#define MAINS_BKUP_MAGIC  0x4D41494EU  /* "MAIN" */
static uint32_t noinit_mains_magic  __attribute__((section(".noinit")));
static uint8_t  noinit_mains_relay1 __attribute__((section(".noinit")));
static uint8_t  noinit_mains_relay2 __attribute__((section(".noinit")));
static uint8_t  noinit_mains_slave  __attribute__((section(".noinit")));  /* Blue Pill relay */
static bool mains_is_off         = false;
static bool mains_restore_relay1 = false;
static bool mains_restore_relay2 = false;
static bool mains_restore_slave  = false;  /* Blue Pill slave relay restore intent */
static uint32_t mains_off_tick    = 0;     /* HAL_GetTick() when mains went OFF    */
static uint64_t mains_off_unix_ms = 0;     /* Modem_GetUnixMs() when mains went OFF */

static uint8_t mqtt_reset_count = 0; /* initialised from noinit RAM in Modem_Init */

static uint8_t bkup_get_reset_count(void)
{
    if (noinit_magic_a == BKUP_MAGIC_A && noinit_magic_b == BKUP_MAGIC_B)
        return noinit_reset_n;
    return 0U;
}
static void bkup_set_reset_count(uint8_t n)
{
    noinit_magic_a = BKUP_MAGIC_A;
    noinit_magic_b = BKUP_MAGIC_B;
    noinit_reset_n = n;
}
static void bkup_clear_reset_count(void)
{
    noinit_magic_a = 0U;
    noinit_magic_b = 0U;
    noinit_reset_n = 0U;
}
static bool     prev_relay1        = false;
static bool     prev_relay2        = false;
static bool     prev_dry_run_trip  = false;

/* signal strength: updated by +CSQ response; 99 = unknown */
static int8_t   last_rssi          = 99;
static uint32_t ota_retry_block_until = 0;
/* Grace period: suppress modem_reinit for 20s after Modem_Init returns.
 * EC200U post-CFUN=1,1 boot may send late URCs (APP RDY) that arrive during
 * the SSL/MQTT config phase — these must not trigger a spurious modem_reinit. */
static uint32_t modem_init_grace_until = 0;

/* Consecutive MQTT reconnect failures — reset to 0 on successful connect.
 * Used to trigger a CFUN hard-reset after 5 consecutive BROKER_OPEN/CONN
 * failures so a stuck TLS state cannot keep the device offline forever.  */
static int disconnected_count = 0;

/* set false when PDP_OPEN is entered; set true when AT+QICSGP is sent from
 * Modem_Process (after the RX buffer is drained) so we never mistake the
 * trailing OK of AT+CGREG? for QICSGP's OK.                                */
static bool qicsgp_sent = false;

/* set false when PDP_ACTIVATE is entered; set true when AT+QIACT=1 is sent
 * from Modem_Process (after the RX buffer is drained) so we never mistake
 * stale OK responses from AT+QMTCLOSE/AT+QIDEACT for QIACT's OK.          */
static bool qiact_sent = false;

/* set true on first AT+QIACT=1 ERROR so the handler force-deactivates and
 * retries once before falling back to NET_WAIT.  Reset on PDP_ACTIVATE entry
 * and on success.  Fixes the post-OTA loop: QIDEACT may silently fail in
 * Modem_Init if HTTP is still closing, leaving the PDP context active.
 * EC200U returns ERROR (not OK) when AT+QIACT=1 is sent on an already-active
 * context, which previously caused an infinite NET_WAIT/PDP loop.           */
static bool qiact_retry_done = false;

/* set true when +QMTOPEN: 0,"hostname",port URC arrives (TLS handshake
 * started).  Success fires only on the subsequent OK (TLS complete).     */
static bool qmtopen_tls_seen = false;
/* Set when unsolicited modem reboot URCs are seen (RDY/+CFUN: 1) so
 * Modem_Process can run a full Modem_Init() re-initialization. */
static bool modem_reinit_pending = false;
/* Set in Modem_Init when this boot was an OTA reboot.  Causes the nuclear
 * CFUN option to fire after just ONE DISCONNECTED failure instead of five,
 * so MQTT reconnects in ~2-4 min rather than ~8-12 min post-OTA.           */
static bool ota_first_reconnect = false;

/* Counts how many 5-s NET_WAIT polling cycles have elapsed.
 * After 36 cycles (3 min) with no LTE registration, force DISCONNECTED
 * so the nuclear CFUN recovery path can fire.                             */
static uint8_t net_wait_tries = 0;

static bool ota_retry_blocked(void)
{
    return ((int32_t)(HAL_GetTick() - ota_retry_block_until) < 0);
}

static void modem_log_reset_flags(uint32_t csr)
{
    char flags[128];
    flags[0] = '\0';
#ifdef RCC_CSR_LPWRRSTF
    if (csr & RCC_CSR_LPWRRSTF) strcat(flags, " LPWR");
#endif
#ifdef RCC_CSR_WWDGRSTF
    if (csr & RCC_CSR_WWDGRSTF) strcat(flags, " WWDG");
#endif
#ifdef RCC_CSR_IWDGRSTF
    if (csr & RCC_CSR_IWDGRSTF) strcat(flags, " IWDG");
#endif
#ifdef RCC_CSR_SFTRSTF
    if (csr & RCC_CSR_SFTRSTF) strcat(flags, " SFTRST");
#endif
#ifdef RCC_CSR_PORRSTF
    if (csr & RCC_CSR_PORRSTF) strcat(flags, " POR");
#endif
#ifdef RCC_CSR_PINRSTF
    if (csr & RCC_CSR_PINRSTF) strcat(flags, " PIN");
#endif
#ifdef RCC_CSR_BORRSTF
    if (csr & RCC_CSR_BORRSTF) strcat(flags, " BOR");
#endif
    if (flags[0] == '\0') strcpy(flags, " <none>");
    {
        char dbg[160];
        snprintf(dbg, sizeof(dbg), "[MODEM] Reset flags:%s\r\n", flags);
        Debug_Print(dbg);
    }
}


/* ═══════════════════════════════════════════════════════════════════════════
 * Low-level UART helpers
 * ═══════════════════════════════════════════════════════════════════════════ */

void Modem_Send(const char *cmd)
{
    if (!modem_uart || !cmd)
        return;
    HAL_UART_Transmit(modem_uart, (const uint8_t *)cmd, strlen(cmd), 2000);
}

/* Read one byte from the modem UART with a per-byte timeout.
 * Uses direct register access (matches Modem_Process fast-path) so the
 * HAL lock is not involved and overrun errors are cleared on every call.
 * Returns 0 on success (*c filled), -1 on timeout or invalid args. */
int Modem_Receive(uint8_t *c, uint32_t timeout_ms)
{
    if (!modem_uart || !c) return -1;
    uint32_t t0 = HAL_GetTick();
    while (HAL_GetTick() - t0 < timeout_ms) {
        IWDG->KR = 0xAAAAU;
        uint32_t isr = modem_uart->Instance->ISR;
        if (isr & (USART_ISR_ORE | USART_ISR_FE | USART_ISR_NE)) {
            modem_uart->Instance->ICR = USART_ICR_ORECF | USART_ICR_FECF | USART_ICR_NECF;
            modem_uart->ErrorCode = HAL_UART_ERROR_NONE;
        }
        if (isr & USART_ISR_RXNE_RXFNE) {
            *c = (uint8_t)(modem_uart->Instance->RDR & 0xFF);
            return 0;
        }
    }
    return -1; /* timeout */
}

static void modem_cmd(const char *cmd)
{
    Modem_Send(cmd);
    Modem_Send("\r\n");
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Diagnostic blink  — N × 80 ms pulses on Relay1 (PA5), saves & restores.
 * Used to indicate MQTT progress without needing a UART adapter.
 *   blink_n(1) = QMTOPEN TCP connected (sent AT+QMTCONN)
 *   blink_n(2) = publish confirmed (broker ACK / OK received)
 *   blink_n(3) = MQTT fully connected (subscribed)  ← SUCCESS
 *   blink_n(4) = AT+QMTPUBEX command sent (publish attempted)
 *   blink_n(5) = QMTCONN REFUSED  ← wrong credentials / broker rejected
 *   blink_n(6) = QMTCONN ERROR    ← AT command layer error
 *   blink_n(7) = server dropped connection (+QMTSTAT received)
 * ═══════════════════════════════════════════════════════════════════════════ */

/* ═══════════════════════════════════════════════════════════════════════════
 * Relay control
 * ═══════════════════════════════════════════════════════════════════════════ */

/* Latching relay via transistor (HIGH = transistor ON = coil energised):
 *   Pump1: PA1 → SET coil, PB3 → RESET coil
 *   Pump2: PB4 → SET coil, PB5 → RESET coil
 * Pulse HIGH 200 ms to latch; relay holds position without power */

void Relay1_Set(bool on)
{
    relay1 = on;
    if (mains_is_off) {
        /* 12V relay supply absent — skip GPIO pulse, just record intent for restore */
        mains_restore_relay1 = on;
        noinit_mains_relay1  = on ? 1U : 0U;
        return;
    }
    if (on) {
        HAL_GPIO_WritePin(Relay_Pin_GPIO_Port,  Relay_Pin_Pin,  GPIO_PIN_SET);   /* PB3 HIGH — SET coil pulse start  */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay_Pin_GPIO_Port,  Relay_Pin_Pin,  GPIO_PIN_RESET); /* PB3 LOW  — SET coil pulse end    */
    } else {
        HAL_GPIO_WritePin(Relay1_RST_GPIO_Port, Relay1_RST_Pin, GPIO_PIN_SET);   /* PA1 HIGH — RESET coil pulse start */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay1_RST_GPIO_Port, Relay1_RST_Pin, GPIO_PIN_RESET); /* PA1 LOW  — RESET coil pulse end   */
    }
}

