Vimalananth/STM32-EC200-Firmware/src/modem.c
    uint32_t age_s    = age_raw / 1000U;
    uint32_t fl_x10   = LoRa_GetFlowLpmX10();
    uint32_t tv_l     = LoRa_GetTotalLitresInt();
    uint32_t depth_mm = LoRa_GetDepthMm();  /* 0xFFFFFFFF = fault/no sensor */
    char st[320];
    int slen = snprintf(st, sizeof(st),
                 "{\"online\":true,\"relay\":%d"
                 ",\"rssi\":%d,\"snr\":%d,\"age_s\":%lu"
                 ",\"fl\":%lu.%lu,\"tv\":%lu"
                 ",\"dp\":%ld",
                 (LoRa_GetRelay3State() == 1) ? 1 : 0,
                 LoRa_GetLastRSSI(), LoRa_GetLastSNR(),
                 (unsigned long)age_s,
                 (unsigned long)(fl_x10 / 10U),
                 (unsigned long)(fl_x10 % 10U),
                 (unsigned long)tv_l,
                 (depth_mm == 0xFFFFFFFFUL) ? -1L : (long)depth_mm);
    if (LoRa_IsModbusValid() && slen > 0 && slen < (int)sizeof(st) - 120)
        slen += snprintf(st + slen, sizeof(st) - (size_t)slen,
                 ",\"v1\":%ld.%ld,\"v2\":%ld.%ld,\"v3\":%ld.%ld"
                 ",\"i1\":%ld.%02ld,\"i2\":%ld.%02ld,\"i3\":%ld.%02ld"
                 ",\"kw\":%ld.%ld,\"kwh\":%lu",
                 (long)(LoRa_GetV1x10()  / 10), (long)(LoRa_GetV1x10()  % 10),
                 (long)(LoRa_GetV2x10()  / 10), (long)(LoRa_GetV2x10()  % 10),
                 (long)(LoRa_GetV3x10()  / 10), (long)(LoRa_GetV3x10()  % 10),
                 (long)(LoRa_GetI1x100() / 100),(long)(LoRa_GetI1x100() % 100),
                 (long)(LoRa_GetI2x100() / 100),(long)(LoRa_GetI2x100() % 100),
                 (long)(LoRa_GetI3x100() / 100),(long)(LoRa_GetI3x100() % 100),
                 (long)(LoRa_GetKWx10()  / 10), (long)(LoRa_GetKWx10()  % 10),
                 (unsigned long)LoRa_GetKWh());
    { uint8_t bp = LoRa_GetSlaveBatPct();
      if (bp <= 100U && slen > 0 && slen < (int)sizeof(st) - 15)
          slen += snprintf(st + slen, sizeof(st) - (size_t)slen, ",\"bat\":%u", (unsigned)bp); }
    if (ts && slen > 0 && slen < (int)sizeof(st) - 25)
        snprintf(st + slen, sizeof(st) - (size_t)slen,
                 ",\"ts\":%lu}", (unsigned long)(ts / 1000ULL));
    else if (slen > 0 && slen < (int)sizeof(st) - 2)
        st[slen] = '}', st[slen + 1] = '\0';
    queue_publish(TOPIC_LINE2_STATUS, st);
}

static void publish_status(void)
{
    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    float i  = Sensor_ReadCurrentACS712();

    char sv1[12], sv2[12], sv3[12], sci[12], skw[10];
    fmt_f1(sv1, sizeof(sv1), v1);
    fmt_f1(sv2, sizeof(sv2), v2);
    fmt_f1(sv3, sizeof(sv3), v3);
    fmt_f2(sci, sizeof(sci), i);
    fmt_f2(skw, sizeof(skw), Modbus_GetKW());

    char scfg_ov[10], scfg_uv[10], scfg_pl[10], scfg_dry_i[10], scfg_dry_i2[10];
    fmt_f1(scfg_ov,    sizeof(scfg_ov),    cfg_ov);
    fmt_f1(scfg_uv,    sizeof(scfg_uv),    cfg_uv);
    fmt_f1(scfg_pl,    sizeof(scfg_pl),    cfg_pl);
    fmt_f2(scfg_dry_i, sizeof(scfg_dry_i), cfg_dry_i);
    fmt_f2(scfg_dry_i2,sizeof(scfg_dry_i2),cfg_dry_i2);

    bool data_ok   = Modbus_IsDataValid();
    bool r1_running = relay1 && data_ok && (i > cfg_dry_i);
    bool r2_running = relay2 && data_ok && (i > cfg_dry_i2); /* relay2 uses its own threshold */

    int r3 = LoRa_GetRelay3State();  /* -1=unknown, 0=OFF, 1=ON */
    int r4 = LoRa_GetRelay4State();
    uint8_t  bat_pct = Battery_ReadPercent();  /* LiPo on PA0; 0xFF if read fails */
    uint32_t bat_mv  = Battery_ReadMv();       /* raw mV, e.g. 3820              */

    char payload[824];
    snprintf(payload, sizeof(payload),
             "{\"relay1_state\":%d,\"relay2_state\":%d,"
             "\"relay1_running\":%d,\"relay2_running\":%d,"
             "\"relay3_state\":%d,\"relay4_state\":%d,"
             "\"v1\":%s,\"v2\":%s,\"v3\":%s,"
             "\"current\":%s,\"kw\":%s,"
             "\"dry_run\":%s,\"dry_run2\":%s,\"online\":true,"
             "\"mb_ok\":%d,\"mb_rx\":%d,\"rssi\":%d,\"boot_phase\":%u,"
             "\"fw\":\"%s\","
             "\"bat\":%u,\"bat_mv\":%lu,"
             "\"cfg_ov\":%s,\"cfg_uv\":%s,\"cfg_pl\":%s,"
             "\"cfg_dry_i\":%s,\"cfg_dry_t\":%d,\"cfg_start_t\":%d,\"cfg_hp\":%d,\"cfg_dry_en\":%d,"
             "\"cfg_dry_i2\":%s,\"cfg_dry_t2\":%d,\"cfg_start_t2\":%d,\"cfg_hp2\":%d,\"cfg_dry_en2\":%d,"
             "\"cfg_uv_rst_t\":%d,\"pwr_off\":%lu,\"mains_dur_s\":%lu}",
             relay1 ? 1 : 0,
             relay2 ? 1 : 0,
             r1_running ? 1 : 0,
             r2_running ? 1 : 0,
             r3, r4,
             sv1, sv2, sv3, sci, skw,
             dry_run_tripped  ? "true" : "false",
             dry_run_tripped2 ? "true" : "false",
             data_ok ? 1 : 0,
             (int)Modbus_GetLastRx(),
             (int)last_rssi,
             (unsigned)g_boot_phase,
             g_fw_ver,
             (unsigned)bat_pct, (unsigned long)bat_mv,
             scfg_ov, scfg_uv, scfg_pl,
             scfg_dry_i, cfg_dry_t, cfg_start_t, cfg_hp, cfg_dry_en,
             scfg_dry_i2, cfg_dry_t2, cfg_start_t2, cfg_hp2, cfg_dry_en2,
             cfg_uv_restart_t,
             (unsigned long)(mains_is_off ? mains_off_unix_ms / 1000ULL : 0UL),
             (unsigned long)(mains_is_off && mains_off_tick ? (HAL_GetTick() - mains_off_tick) / 1000U : 0U));

    queue_publish(TOPIC_STATUS, payload);
}

static void publish_status2(void)
{
    /* pump02 status — relay1_state maps to physical relay2 (PB4/PB5) */
    char payload[48];
    snprintf(payload, sizeof(payload),
             "{\"relay1_state\":%d,\"online\":true}",
             relay2 ? 1 : 0);
    queue_publish(TOPIC_STATUS2, payload);
}

static void publish_alert(bool ov, bool uv, bool pl, bool dr)
{
    char payload[128];
    snprintf(payload, sizeof(payload),
             "{\"overvoltage\":%s,\"undervoltage\":%s,"
             "\"phase_loss\":%s,\"dry_run_trip\":%s}",
             ov ? "true" : "false",
             uv ? "true" : "false",
             pl ? "true" : "false",
             dr ? "true" : "false");

