Vimalananth/STM32-EC200-Firmware/src/modem.c
    queue_publish(TOPIC_ALERTS, payload);
}

static void publish_alert2(bool ov, bool uv, bool pl, bool dr)
{
    char payload[128];
    snprintf(payload, sizeof(payload),
             "{\"overvoltage\":%s,\"undervoltage\":%s,"
             "\"phase_loss\":%s,\"dry_run_trip\":%s}",
             ov ? "true" : "false",
             uv ? "true" : "false",
             pl ? "true" : "false",
             dr ? "true" : "false");
    queue_publish(TOPIC_ALERTS2, payload);
}

static void RelayState_Save(void); /* forward declaration */

/* ═══════════════════════════════════════════════════════════════════════════
 * Relay log — publishes on/off events to TOPIC_LOG
 * ═══════════════════════════════════════════════════════════════════════════ */

static void log_relay_event(int relay_num, bool on, const char *reason)
{
    char payload[128];
    uint32_t *on_tick   = (relay_num == 2) ? &relay2_on_tick        : &relay1_on_tick;
    uint32_t *accum     = (relay_num == 2) ? &run_accum2_ms         : &run_accum1_ms;
    uint32_t *last_tk   = (relay_num == 2) ? &last_r2_run_tick      : &last_r1_run_tick;
    uint32_t *saved_ms  = (relay_num == 2) ? &run_accum2_saved_ms   : &run_accum1_saved_ms;
    uint64_t ts_ms = Modem_GetUnixMs(); /* 0 until network time synced */
    if (on) {
        *on_tick   = HAL_GetTick();
        *accum     = 0;   /* reset accumulator for new run session */
        *last_tk   = 0;
        *saved_ms  = 0;
        if (ts_ms)
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"on\",\"reason\":\"%s\",\"relay\":%d,\"ts\":%lu}",
                     reason, relay_num, (unsigned long)(ts_ms / 1000ULL));
        else
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"on\",\"reason\":\"%s\",\"relay\":%d}", reason, relay_num);
    } else {
        /* run_s = total confirmed-running time this session.
         * Accumulator only increments when current > threshold, so preventer
         * OFF gaps (current=0) are excluded from the run time. */
        uint32_t run_s = *accum / 1000;
        *on_tick  = 0;
        *accum    = 0;
        *last_tk  = 0;
        if (ts_ms)
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"off\",\"reason\":\"%s\",\"run_s\":%lu,\"relay\":%d,\"ts\":%lu}",
                     reason, (unsigned long)run_s, relay_num, (unsigned long)(ts_ms / 1000ULL));
        else
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"off\",\"reason\":\"%s\",\"run_s\":%lu,\"relay\":%d}",
                     reason, (unsigned long)run_s, relay_num);
    }
    queue_publish((relay_num == 2) ? TOPIC_LOG2 : TOPIC_LOG, payload);
    RelayState_Save();
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Protection logic  — called every 1 s when connected
 * ═══════════════════════════════════════════════════════════════════════════ */

static bool is_volt_fault(void)
{
    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    return (v1 > cfg_ov || v2 > cfg_ov || v3 > cfg_ov) ||
           (v1 < cfg_uv || v2 < cfg_uv || v3 < cfg_uv) ||
           (v1 < cfg_pl || v2 < cfg_pl || v3 < cfg_pl);
}

/* Return overcurrent trip threshold (A) for the given HP rating.
 * Based on 415 V 3-phase, PF 0.85, with 150 % thermal overload margin.
 * Returns 0 when HP = 0 (custom / disabled).
 *   5HP  = 3730 W → I_rated 6.1 A → 150 % = 9.1 A → trip at 11 A
 *   7.5HP= 5595 W → I_rated 9.1 A → 150 % = 13.7 A → trip at 16 A  */
static float overload_limit_for_hp(int hp)
{
    if (hp == 5)  return 11.0f;
    if (hp == 75) return 16.0f;
    return 0.0f;  /* 0 = disabled */
}

static void check_mains_state(void)
{
    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    bool all_dead = (v1 < MAINS_OFF_V && v2 < MAINS_OFF_V && v3 < MAINS_OFF_V);
    static bool prev_dead = false;

    if (!prev_dead && all_dead) {
        /* ── Mains just went OFF ── */
        /* 12V relay coil supply is mains-powered — cannot pulse coil now. Just record
         * which relay was running so it can be restored when 12V returns.
         * Prefer noinit if valid: a soft-reboot during mains-off preserves rotation intent. */
        bool ni_valid = (noinit_mains_magic == MAINS_BKUP_MAGIC) &&
                        (noinit_mains_relay1 <= 1U) && (noinit_mains_relay2 <= 1U) &&
                        (noinit_mains_slave  <= 1U);
        mains_restore_relay1 = ni_valid ? (noinit_mains_relay1 != 0U) : relay1;
        mains_restore_relay2 = ni_valid ? (noinit_mains_relay2 != 0U) : relay2;
        /* Slave state: prefer noinit; fall back to last known heartbeat state */
        mains_restore_slave  = ni_valid ? (noinit_mains_slave != 0U)
                                        : (LoRa_GetRelay3State() == 1);
        noinit_mains_relay1 = mains_restore_relay1 ? 1U : 0U;
        noinit_mains_relay2 = mains_restore_relay2 ? 1U : 0U;
        noinit_mains_slave  = mains_restore_slave  ? 1U : 0U;
        noinit_mains_magic  = MAINS_BKUP_MAGIC;

        /* Mark relays OFF in software and save to flash.  The relay coil is physically
         * unpulseable (no 12V), so the relay stays mechanically latched — but that is
         * harmless because the pump motor has no AC supply to run on. */
        relay1 = false; relay2 = false;
        RelayState_Save();

        /* Tell slave to record OFF state — same 12V constraint applies to Blue Pill relay.
         * LoRa module is battery-powered so the command can be transmitted; slave receives
         * it but the coil pulse is a no-op (slave's 12V also absent). */
        LoRa_SendRelay(1, false);

        mains_is_off      = true;
        mains_off_tick    = HAL_GetTick();
        mains_off_unix_ms = Modem_GetUnixMs();
        Debug_Print("[PWR] Mains OFF — state recorded (relay coil unpulseable, no 12V)\r\n");
    }
    else if (prev_dead && !all_dead) {
        /* ── Mains just came back ON ── */
        /* 12V is restored — we can now energise the relay coils. */
        mains_is_off = false;
        noinit_mains_magic = 0U;   /* clear mains backup */

        /* Clear UV/PL trip flags so protection does not immediately block restore */
        uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
        uv_pl_tripped2 = false; uv_cleared_ms2 = 0;

        /* Step 1: RESET both relay coils to reach a known-OFF state.
         * The relay may be physically latched ON from before the outage.
         * Relay*_Set(false) always pulses the RESET coil regardless of current state. */
        Relay1_Set(false);
        Relay2_Set(false);

