Vimalananth/STM32-EC200-Firmware/src/modem.c
        /* Step 2: Restore the correct relay — interlock ensures only one at a time */
        if (mains_restore_relay1) {
            Relay1_Set(true);
            relay1_on_tick = HAL_GetTick();   /* re-arm startup grace (UV/PL suppression) */
            log_relay_event(1, true, "mains_restore");
        } else if (mains_restore_relay2) {
            Relay2_Set(true);
            relay2_on_tick = HAL_GetTick();
            log_relay_event(2, true, "mains_restore");
        }
        RelayState_Save();

        /* Restore slave (Blue Pill) relay — 12V now available at slave too.
         * P1:ON or P1:OFF as appropriate; redundant coil pulses on latching relay are harmless. */
        LoRa_SendRelay(1, mains_restore_slave);

        /* Publish outage duration to log so Flutter app can display daily history */
        {
            uint32_t dur_s = mains_off_tick
                ? (HAL_GetTick() - mains_off_tick) / 1000U : 0U;
            uint64_t ts_ms = Modem_GetUnixMs();
            char pwr_log[128];
            if (ts_ms && mains_off_unix_ms)
                snprintf(pwr_log, sizeof(pwr_log),
                         "{\"event\":\"mains_restore\",\"duration_s\":%lu,"
                         "\"off_ts\":%lu,\"ts\":%lu}",
                         (unsigned long)dur_s,
                         (unsigned long)(mains_off_unix_ms / 1000ULL),
                         (unsigned long)(ts_ms / 1000ULL));
            else
                snprintf(pwr_log, sizeof(pwr_log),
                         "{\"event\":\"mains_restore\",\"duration_s\":%lu}",
                         (unsigned long)dur_s);
            queue_publish(TOPIC_LOG, pwr_log);
            mains_off_tick = 0; mains_off_unix_ms = 0;
        }
        Debug_Print("[PWR] Mains ON — relays reset then correct pump restored\r\n");
    }
    prev_dead = all_dead;
}

static void run_protection(void)
{
    /* Skip all protection until the first valid Modbus read arrives.
     * With zero defaults, both UV and dry-run would fire immediately otherwise. */
    if (!Modbus_IsDataValid()) return;

    check_mains_state();

    static bool prev_r1_running = false;
    static bool prev_r2_running = false;

    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    float i = Sensor_ReadCurrentACS712();

    bool ov = (v1 > cfg_ov || v2 > cfg_ov || v3 > cfg_ov);
    bool uv = (v1 < cfg_uv || v2 < cfg_uv || v3 < cfg_uv);
    bool pl = (v1 < cfg_pl || v2 < cfg_pl || v3 < cfg_pl);

    /* Startup grace windows — computed once, reused for both voltage and dry-run suppression.
     * During the grace window UV+PL are ignored: motor inrush can briefly dip the supply.
     * OV protection stays active at all times (overvoltage during startup is dangerous). */
    bool relay1_in_startup = relay1_on_tick &&
        (HAL_GetTick() - relay1_on_tick < (uint32_t)cfg_start_t * 1000U);
    bool relay2_in_startup = relay2_on_tick &&
        (HAL_GetTick() - relay2_on_tick < (uint32_t)cfg_start_t2 * 1000U);

    /* OV always trips.  UV+PL only trip once the startup grace window has expired. */
    bool volt_trip1 = ov || (!relay1_in_startup && (uv || pl));
    bool volt_trip2 = ov || (!relay2_in_startup && (uv || pl));

    /* Hold: fault must persist for VOLT_TRIP_HOLD_S consecutive 1-s samples.
     * Avoids nuisance trips from momentary dips or meter glitches. */
    if (volt_trip1) { if (volt_trip_count1 < VOLT_TRIP_HOLD_S) volt_trip_count1++; }
    else            { volt_trip_count1 = 0U; }
    if (volt_trip2) { if (volt_trip_count2 < VOLT_TRIP_HOLD_S) volt_trip_count2++; }
    else            { volt_trip_count2 = 0U; }

    if (volt_trip_count1 >= VOLT_TRIP_HOLD_S && relay1)
    {
        Relay1_Set(false);
        /* Mark UV/PL trip for auto-restart — OV is dangerous, never auto-restart */
        if (!ov) { uv_pl_tripped1 = true; uv_cleared_ms1 = 0; }
        log_relay_event(1, false, ov ? "overvoltage" : (uv ? "undervoltage" : "phase_loss"));
        publish_alert(ov, uv, pl, false);
        volt_alert_sent1 = true;
        Debug_Print("[PROT] Voltage fault — pump1 OFF\r\n");
    }

    if (volt_trip_count2 >= VOLT_TRIP_HOLD_S && relay2)
    {
        Relay2_Set(false);
        if (!ov) { uv_pl_tripped2 = true; uv_cleared_ms2 = 0; }
        log_relay_event(2, false, ov ? "overvoltage" : (uv ? "undervoltage" : "phase_loss"));
        publish_alert2(ov, uv, pl, false);
        volt_alert_sent2 = true;
        Debug_Print("[PROT] Voltage fault — pump2 OFF\r\n");
    }

    /* If UV/PL dips again while we're waiting to auto-restart, reset the
     * recovery timer so the N-second count restarts from the next clear. */
    if ((uv || pl) && !ov) {
        if (uv_pl_tripped1 && uv_cleared_ms1) { uv_cleared_ms1 = 0; }
        if (uv_pl_tripped2 && uv_cleared_ms2) { uv_cleared_ms2 = 0; }
    }

    if ((ov || uv || pl) && (relay1 || relay2))
        return;

    /* Voltage OK — clear alerts and handle UV/PL auto-restart */
    if (!ov && !uv && !pl)
    {
        if (volt_alert_sent1) {
            volt_alert_sent1 = false;
            publish_alert(false, false, false, false);
            Debug_Print("[PROT] Voltage fault cleared — pump1 alert reset\r\n");
        }
        if (volt_alert_sent2) {
            volt_alert_sent2 = false;
            publish_alert2(false, false, false, false);
            Debug_Print("[PROT] Voltage fault cleared — pump2 alert reset\r\n");
        }

        /* ── UV/PL auto-restart ─────────────────────────────────────────────
         * If relay was tripped by UV/PL (not OV) and cfg_uv_restart_t > 0,
         * wait N seconds after voltage recovers then restart automatically. */
        if (uv_pl_tripped1) {
            if (relay1) {
                /* Relay was manually restarted — cancel auto-restart */
                uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
            } else if (relay2) {
                /* relay2 was turned ON while relay1 was tripped — cancel
                 * auto-restart to maintain mutual exclusion (only one pump
                 * can run at a time).                                      */
                uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
                Debug_Print("[PROT] UV auto-restart cancelled — pump2 active\r\n");
            } else if (cfg_uv_restart_t > 0) {
                if (uv_cleared_ms1 == 0) {
                    uv_cleared_ms1 = HAL_GetTick();
                    Debug_Print("[PROT] UV/PL cleared — auto-restart timer started\r\n");
                } else if (!dry_run_tripped &&
                           HAL_GetTick() - uv_cleared_ms1 >= (uint32_t)cfg_uv_restart_t * 1000U) {
                    uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
                    Relay1_Set(true);
                    relay1_on_tick = HAL_GetTick();
                    log_relay_event(1, true, "uv_restart");
                    publish_status();
                    Debug_Print("[PROT] UV/PL auto-restart — pump1 ON\r\n");
                }
            } else {
                /* Auto-restart disabled — clear flag so it doesn't linger */
                uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
            }
        }

        if (uv_pl_tripped2) {
            if (relay2) {
                uv_pl_tripped2 = false; uv_cleared_ms2 = 0;
            } else if (relay1) {
                /* relay1 was turned ON while relay2 was tripped — cancel
                 * auto-restart to maintain mutual exclusion.              */
                uv_pl_tripped2 = false; uv_cleared_ms2 = 0;
                Debug_Print("[PROT] UV auto-restart cancelled — pump1 active\r\n");
            } else if (cfg_uv_restart_t > 0) {
                if (uv_cleared_ms2 == 0) {
                    uv_cleared_ms2 = HAL_GetTick();
                    Debug_Print("[PROT] UV/PL cleared — auto-restart timer started (pump2)\r\n");
                } else if (!dry_run_tripped2 &&
                           HAL_GetTick() - uv_cleared_ms2 >= (uint32_t)cfg_uv_restart_t * 1000U) {
                    uv_pl_tripped2 = false; uv_cleared_ms2 = 0;
                    Relay2_Set(true);
                    relay2_on_tick = HAL_GetTick();
                    log_relay_event(2, true, "uv_restart");
                    publish_status();
                    Debug_Print("[PROT] UV/PL auto-restart — pump2 ON\r\n");
                }
            } else {
                uv_pl_tripped2 = false; uv_cleared_ms2 = 0;
            }
        }
    }

