Vimalananth/STM32-EC200-Firmware/src/modem.c
static bool extract_str(const char *json, const char *key, char *out, size_t max)
{
    char search[40];
    snprintf(search, sizeof(search), "\"%s\":\"", key);
    const char *p = strstr(json, search);
    if (!p) return false;
    p += strlen(search);
    size_t i = 0;
    while (*p && *p != '"' && i < max - 1)
        out[i++] = *p++;
    out[i] = '\0';
    return (i > 0);
}

/* Accept OTA trigger payloads in either format:
 *   {"url":"https://..."}   or   https://...
 * Extract URL from any line containing http/https text. */
static bool extract_ota_url_any(const char *text, char *out, size_t max)
{
    const char *p = strstr(text, "https://");
    if (!p) p = strstr(text, "http://");
    if (!p) return false;

    size_t i = 0;
    while (*p && i < max - 1) {
        char c = *p;
        if (c == '"' || c == ',' || c == ' ' || c == '\r' || c == '\n')
            break;
        out[i++] = c;
        p++;
    }
    out[i] = '\0';
    return (i > 0);
}

static void modem_ota_start(const char *url, uint32_t expected_crc32); /* forward declaration */
static void modem_ota_publish(const char *topic, const char *payload); /* forward declaration */
static void modem_lora_ota_publish(const char *topic, const char *payload); /* forward declaration */
static bool modem_is_exact_reboot_urc(const char *line);

/* ── Relay state persistence (Flash page 31 = 0x0800F800, 2KB) ──────────────
 * Saves relay1/relay2 ON/OFF state so a power-cycle reboot restores the
 * physical latching-relay position correctly instead of defaulting to OFF. */
#define RELAY_STATE_MAGIC  0xFEED5A5CU  /* bumped: struct now includes run_accum */
#define RELAY_STATE_ADDR   0x0800F800U
#define RELAY_STATE_PAGE   31U

typedef struct {
    uint32_t magic;
    uint32_t relay1;         /* 1 = ON, 0 = OFF */
    uint32_t relay2;
    uint32_t run_accum1_ms;  /* saved running time relay1 — restored on power-on */
    uint32_t run_accum2_ms;  /* saved running time relay2 — restored on power-on */
    uint32_t _pad;           /* 24 bytes total — 3 doublewords */
} RelayState_t;

static void RelayState_Save(void)
{
    RelayState_t s;
    s.magic         = RELAY_STATE_MAGIC;
    s.relay1        = relay1 ? 1U : 0U;
    s.relay2        = relay2 ? 1U : 0U;
    s.run_accum1_ms = run_accum1_ms;
    s.run_accum2_ms = run_accum2_ms;
    s._pad          = 0U;

    HAL_FLASH_Unlock();
    FLASH_EraseInitTypeDef erase = {
        .TypeErase = FLASH_TYPEERASE_PAGES,
        .Page      = RELAY_STATE_PAGE,
        .NbPages   = 1,
    };
    uint32_t page_err = 0;
    HAL_FLASHEx_Erase(&erase, &page_err);

    uint64_t buf[3];
    memcpy(buf, &s, sizeof(s));
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, RELAY_STATE_ADDR,        buf[0]);
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, RELAY_STATE_ADDR + 8U,   buf[1]);
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, RELAY_STATE_ADDR + 16U,  buf[2]);
    HAL_FLASH_Lock();
    Debug_Print("[CFG] Relay state saved to Flash\r\n");
}

static void RelayState_Load(void)
{
    const RelayState_t *p = (const RelayState_t *)RELAY_STATE_ADDR;
    if (p->magic != RELAY_STATE_MAGIC) {
        Debug_Print("[CFG] No saved relay state — defaulting OFF\r\n");
        /* Bistable relays hold position through power-loss.
         * Explicitly reset both so contacts match the expected default. */
        Relay1_Set(false);
        Relay2_Set(false);
        return;
    }
    bool r1 = p->relay1 ? true : false;
    bool r2 = (p->relay2 && !r1) ? true : false;  /* interlock: relay2 OFF if relay1 ON */

    /* Restore accumulated run time — only meaningful if relay was ON when saved.
     * Also sync the saved_ms sentinel so the first running tick does not
     * immediately trigger a redundant flash save (save_ms=0 vs accum>900 s). */
    if (r1) { run_accum1_ms = p->run_accum1_ms; run_accum1_saved_ms = p->run_accum1_ms; }
    if (r2) { run_accum2_ms = p->run_accum2_ms; run_accum2_saved_ms = p->run_accum2_ms; }

    /* Step 1: RESET both relays to a known OFF state first.
     * Bistable relays hold their mechanical position through power-loss so
     * the physical state on boot is unknown.  Resetting both guarantees a
     * clean starting point before re-applying the saved state. */
    Relay1_Set(false);
    Relay2_Set(false);

    /* Step 2: wait 500 ms before re-energising.
     * On a watchdog/software reboot the motor contactor may still be closed
     * and the motor shaft still spinning.  The delay allows the contactor
     * to fully open and the motor to coast down before the SET pulse is
     * sent, avoiding inrush current and mechanical stress on re-close. */
    HAL_Delay(500);

    /* Step 3: restore saved state — SET whichever relay was ON.
     * Record relay_on_tick so the startup grace window (UV/PL suppression)
     * applies correctly — without this, inrush dip on restore could false-trip. */
    if (r1) { Relay1_Set(true); relay1_on_tick = HAL_GetTick(); }
    if (r2) { Relay2_Set(true); relay2_on_tick = HAL_GetTick(); }
    Debug_Print("[CFG] Relay state restored from Flash\r\n");
}

/* ── Settings flash persistence (Flash page 62 = 0x0801F000, 2 KB) ──────────
 * Settings are saved every time apply_settings() / apply_settings2() runs.
 * On boot Settings_Load() restores them so protection uses the last Firebase
 * values even before the MQTT broker re-delivers the settings topic.
 * Page layout: 64 bytes = 8 doublewords, CRC32 over the first 60 bytes.    */
#define SETTINGS_FLASH_ADDR  0x0801F000UL
#define SETTINGS_PAGE        62U
#define SETTINGS_MAGIC       0xBEEF0001UL

typedef struct {
    uint32_t magic;
    float    ov, uv, pl, dry_i;            /* relay1 voltage + dry-run float settings */
    int32_t  dry_t, hp, dry_en, start_t, uv_rst; /* relay1 int settings */
    float    dry_i2;                        /* relay2 dry-run threshold */
    int32_t  dry_t2, hp2, dry_en2, start_t2; /* relay2 int settings */
    uint32_t crc;                           /* CRC32 over all fields above */
} SettingsBlock_t;
