Vimalananth/STM32-EC200-Firmware/src/modem.c
_Static_assert(sizeof(SettingsBlock_t) == 64U, "SettingsBlock_t must be 64 bytes");

static uint32_t settings_crc32(const void *data, size_t len)
{
    const uint8_t *p = (const uint8_t *)data;
    uint32_t crc = 0xFFFFFFFFUL;
    for (size_t i = 0; i < len; i++) {
        crc ^= p[i];
        for (int b = 0; b < 8; b++)
            crc = (crc >> 1) ^ (0xEDB88320UL & (uint32_t)(-(int32_t)(crc & 1U)));
    }
    return ~crc;
}

static void Settings_Load(void)
{
    const SettingsBlock_t *p = (const SettingsBlock_t *)SETTINGS_FLASH_ADDR;
    if (p->magic != SETTINGS_MAGIC) {
        Debug_Print("[CFG] No saved settings — using defaults\r\n");
        return;
    }
    uint32_t expected = settings_crc32(p, sizeof(*p) - sizeof(p->crc));
    if (expected != p->crc) {
        Debug_Print("[CFG] Settings CRC mismatch — using defaults\r\n");
        return;
    }
    cfg_ov           = p->ov;
    cfg_uv           = p->uv;
    cfg_pl           = p->pl;
    cfg_dry_i        = p->dry_i;
    cfg_dry_t        = (int)p->dry_t;
    cfg_hp           = (int)p->hp;
    cfg_dry_en       = (int)p->dry_en;
    cfg_start_t      = (int)p->start_t;
    cfg_uv_restart_t = (int)p->uv_rst;
    cfg_dry_i2       = p->dry_i2;
    cfg_dry_t2       = (int)p->dry_t2;
    cfg_hp2          = (int)p->hp2;
    cfg_dry_en2      = (int)p->dry_en2;
    cfg_start_t2     = (int)p->start_t2;
    Debug_Print("[CFG] Settings restored from flash\r\n");
}

static void Settings_Save(void)
{
    SettingsBlock_t blk;
    blk.magic    = SETTINGS_MAGIC;
    blk.ov       = cfg_ov;
    blk.uv       = cfg_uv;
    blk.pl       = cfg_pl;
    blk.dry_i    = cfg_dry_i;
    blk.dry_t    = (int32_t)cfg_dry_t;
    blk.hp       = (int32_t)cfg_hp;
    blk.dry_en   = (int32_t)cfg_dry_en;
    blk.start_t  = (int32_t)cfg_start_t;
    blk.uv_rst   = (int32_t)cfg_uv_restart_t;
    blk.dry_i2   = cfg_dry_i2;
    blk.dry_t2   = (int32_t)cfg_dry_t2;
    blk.hp2      = (int32_t)cfg_hp2;
    blk.dry_en2  = (int32_t)cfg_dry_en2;
    blk.start_t2 = (int32_t)cfg_start_t2;
    blk.crc      = settings_crc32(&blk, sizeof(blk) - sizeof(blk.crc));

    HAL_FLASH_Unlock();
    FLASH_EraseInitTypeDef erase = {
        .TypeErase = FLASH_TYPEERASE_PAGES,
        .Page      = SETTINGS_PAGE,
        .NbPages   = 1,
    };
    uint32_t page_err = 0;
    HAL_FLASHEx_Erase(&erase, &page_err);

    uint64_t buf[sizeof(blk) / 8];
    memcpy(buf, &blk, sizeof(blk));
    for (size_t i = 0; i < sizeof(buf) / sizeof(buf[0]); i++)
        HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, SETTINGS_FLASH_ADDR + i * 8U, buf[i]);

    HAL_FLASH_Lock();
    Debug_Print("[CFG] Settings saved to flash\r\n");
}

/* Apply protection settings from JSON payload */
static void apply_settings(const char *json)
{
    float v;
    int   t;
    /* Validated ranges prevent corrupt/typo payloads from disabling protection */
    v = extract_float(json, "ov",    cfg_ov);
    if (v >= 350.0f && v <= 550.0f) cfg_ov = v;

    v = extract_float(json, "uv",    cfg_uv);
    if (v >= 150.0f && v <= 430.0f) cfg_uv = v;

    v = extract_float(json, "pl",    cfg_pl);
    if (v >= 50.0f  && v <= 350.0f) cfg_pl = v;

    v = extract_float(json, "dry_i", cfg_dry_i);
    if (v >= 0.5f   && v <= 20.0f)  cfg_dry_i = v;

    t = extract_int(json, "dry_t");
    if (t >= 1 && t <= 600) cfg_dry_t = t;

    t = extract_int(json, "hp");
    if (t == 0 || t == 5 || t == 75) cfg_hp = t;

    if (strstr(json, "\"dry_en\":"))
        cfg_dry_en = extract_int(json, "dry_en") ? 1 : 0;

    t = extract_int(json, "start_t");
    if (t >= 1 && t <= 3600) cfg_start_t = t;

    if (strstr(json, "\"uv_rst\":")) {
        t = extract_int(json, "uv_rst");
        if (t >= 0 && t <= 3600) cfg_uv_restart_t = t;
    }
    Settings_Save();
    Debug_Print("[CFG] Settings updated\r\n");
    publish_status(); /* reflect new cfg_ values immediately — don't wait for next heartbeat */
}

/* Apply relay2-specific settings (dry_i/dry_t/dry_en/hp only — voltage shared) */
static void apply_settings2(const char *json)
{
    float v;
    int   t;
    v = extract_float(json, "dry_i", cfg_dry_i2);
    if (v >= 0.5f && v <= 20.0f) cfg_dry_i2 = v;

    t = extract_int(json, "dry_t");
    if (t >= 1 && t <= 600) cfg_dry_t2 = t;

    t = extract_int(json, "hp");
    if (t == 0 || t == 5 || t == 75) cfg_hp2 = t;

    if (strstr(json, "\"dry_en\":"))
        cfg_dry_en2 = extract_int(json, "dry_en") ? 1 : 0;

    t = extract_int(json, "start_t");
    if (t >= 1 && t <= 3600) cfg_start_t2 = t;

    Settings_Save();
    Debug_Print("[CFG] Settings2 updated\r\n");
    publish_status(); /* cfg_dry_en2 is in pump01 status — publish immediately */
}

/* ═══════════════════════════════════════════════════════════════════════════
 * SMS remote control — STATUS query and hardware RESET via SMS
 * ═══════════════════════════════════════════════════════════════════════════ */

/* Forward declaration — modem_sync_expect is defined later in this file */
static bool modem_sync_expect(const char *expected, uint32_t timeout_ms);

/* Send an SMS reply to <number>.  Waits for the '>' prompt then sends text. */
static void sms_reply(const char *number, const char *text)
{
    char cmd[40];
    snprintf(cmd, sizeof(cmd), "AT+CMGS=\"%s\"", number);
    modem_cmd(cmd);
    /* Wait up to 5 s for the '>' prompt */
    uint32_t t0 = HAL_GetTick();
    bool got_prompt = false;
    while (HAL_GetTick() - t0 < 5000)
    {
        uint8_t b;
        IWDG->KR = 0xAAAAU;
        if (HAL_UART_Receive(modem_uart, &b, 1, 100) == HAL_OK && b == '>')
        {
            got_prompt = true;
            break;
        }
    }
    if (!got_prompt)
    {
        Debug_Print("[SMS] No '>' prompt — reply aborted\r\n");
        return;
    }
    HAL_UART_Transmit(modem_uart, (uint8_t *)text, strlen(text), 3000);
    uint8_t ctrlz = 0x1A;
    HAL_UART_Transmit(modem_uart, &ctrlz, 1, 1000);
    modem_sync_expect("OK", 10000); /* wait for +CMGS: / OK */
    Debug_Print("[SMS] Reply sent\r\n");
}

/* Read the stored SMS at sms_index, parse sender + body, act on command. */
static void sms_process(void)
{
    if (!sms_pending) return;
    sms_pending = false;

    /* Flush any stale UART bytes before sending AT+CMGR */
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 1) == HAL_OK) {} }

    char cmd[24];
    snprintf(cmd, sizeof(cmd), "AT+CMGR=%d", sms_index);
    modem_cmd(cmd);

