Vimalananth/STM32-EC200-Firmware/src/modem.c
static void process_line(const char *line)
{
    char dbg[80];

    /* ── always log non-empty lines to debug UART ── */
    if (line[0] && MODEM_TRACE_LINES)
    {
        snprintf(dbg, sizeof(dbg), "[EC200U] %s\r\n", line);
        Debug_Print(dbg);
    }

    /* Modem restarted unexpectedly (brownout/reset): all runtime MQTT/SSL
     * config is lost. Schedule a full Modem_Init() instead of partial retry.
     * Suppress during the 20s grace period after Modem_Init — late boot URCs
     * (APP RDY, +CFUN: 1) from the AT+CFUN=1,1 OTA reboot path must not
     * trigger a spurious re-init.                                            */
    if (!OTA_IsActive() &&
        modem_is_exact_reboot_urc(line) &&
        mqtt_state != MQTT_STATE_BOOT &&
        (int32_t)(HAL_GetTick() - modem_init_grace_until) >= 0)
    {
        modem_reinit_pending = true;
        Debug_Print("[MODEM] Unsolicited modem reboot detected\r\n");
    }

    /* Forward ALL lines to OTA state machine during an active OTA download.
     * OTA_HandleLine() handles HTTP/file URCs (+QHTTPGET, +QFOPEN, CONNECT).
     * Return early so MQTT logic doesn't misinterpret AT responses as MQTT. */
    if (OTA_IsActive())
    {
        OTA_HandleLine(line);
        return;
    }

    /* Forward all lines to LoRa OTA state machine during active LoRa OTA.
     * LoRaOta_HandleLine() handles HTTPS/file URCs and LoRa ACK responses. */
    if (LoRaOta_IsActive())
    {
        LoRaOta_HandleLine(line);
        return;
    }

    /* +QMTRECV: incoming command — handle in ANY state that has an active
     * MQTT session so relay commands work even during PUBLISHING/PUB_WAIT_OK.
     * Some EC200U firmware versions put the JSON payload on the SAME line:
     *   +QMTRECV: 0,0,"pump/01/cmd","{"relay1":1,"relay2":0}"
     * Others put it on the NEXT line (split format):
     *   +QMTRECV: 0,0,"pump/01/cmd",23
     *   {"relay1":1,"relay2":0}
     * The recv_payload_pending flag handles the split-line case.             */

    /* Case: payload arrived on line following +QMTRECV header */
    if (recv_payload_pending)
    {
        /* Plain-text RESET command */
        if (strcmp(line, "RESET") == 0) {
            recv_payload_pending = false;
            recv_pending_topic[0] = '\0';
            Debug_Print("[CMD] MQTT reset — rebooting\r\n");
            bkup_clear_reset_count();
            IWDG->KR = 0xAAAAU;
            NVIC_SystemReset();
        }
        const char *json = strchr(line, '{');
        if (json)
        {
            recv_payload_pending = false;
            /* Settings topic — check recv_pending_topic (split-line) OR
             * the full line (inline response after AT+QMTRECV poll where
             * recv_pending_topic was cleared in the buffer-mode handler). */
            if (strstr(recv_pending_topic, TOPIC_SETTINGS) ||
                strstr(line, TOPIC_SETTINGS))
            {
                apply_settings(json);
                recv_pending_topic[0] = '\0';
                return;
            }
            if (strstr(recv_pending_topic, TOPIC_SETTINGS2) ||
                strstr(line, TOPIC_SETTINGS2))
            {
                apply_settings2(json);
                recv_pending_topic[0] = '\0';
                return;
            }
            /* pump/02/cmd — relay1 field maps to physical relay2 (PB4/PB5)
             * Check BOTH recv_pending_topic (split-line) AND current line
             * (inline: topic+payload on same AT+QMTRECV response line) */
            bool is_pump2_cmd = strstr(recv_pending_topic, TOPIC_CMD2) != NULL ||
                                 strstr(line, TOPIC_CMD2) != NULL;
            recv_pending_topic[0] = '\0';
            if (is_pump2_cmd)
            {
                int r = extract_int(json, "relay1");
                if (r >= 0)
                {
                    char cmd_src[16] = "";
                    extract_str(json, "src", cmd_src, sizeof(cmd_src));
                    if (r == 1 && relay1) {
                        Debug_Print("[CMD] Relay2 ON blocked — relay1 active\r\n");
                        return;
                    }
                    if (r == 1 && is_volt_fault()) {
                        Debug_Print("[CMD] Relay2 ON blocked — voltage fault\r\n");
                        return;
                    }
                    if (r == 1 && HAL_GetTick() < lockout_until2) {
                        Debug_Print("[CMD] Relay2 ON blocked — lockout active\r\n");
                        return;
                    }
                    bool prev2 = relay2;
                    Relay2_Set(r == 1);
                    if (relay2 != prev2) {
                        log_relay_event(2, relay2, cmd_src[0] ? cmd_src : "manual");
                        publish_status2();
                    }
                }
                return;
            }
            /* LoRa OTA trigger: {"url":"https://..."} on lora_ota topic */
            if (strstr(recv_pending_topic, TOPIC_LORA_OTA) ||
                strstr(line, TOPIC_LORA_OTA))
            {
                char lora_url[200];
                recv_pending_topic[0] = '\0';
                if (extract_str(json, "url", lora_url, sizeof(lora_url)))
                    LoRaOta_Start(lora_url);
                return;
            }
            /* OTA command: {"url":"https://...","crc32":"AABBCCDD"} */
            char ota_url[200];
            if (extract_str(json, "url", ota_url, sizeof(ota_url)))
            {
                if (ota_retry_blocked()) {
                    Debug_Print("[OTA] Ignored trigger (cooldown after reboot)\r\n");
                    return;
                }
                char crc_str[12] = {0};
                uint32_t ref_crc = 0;
                if (extract_str(json, "crc32", crc_str, sizeof(crc_str)))
                    ref_crc = (uint32_t)strtoul(crc_str, NULL, 16);
                modem_ota_start(ota_url, ref_crc);
                return;
            }
            int r1 = extract_int(json, "relay1");
            if (r1 >= 0)
            {
                if (r1 == 1 && relay2)
                    Debug_Print("[CMD] Relay1 ON blocked — relay2 active\r\n");
                else if (r1 == 1 && HAL_GetTick() < lockout_until)
                    Debug_Print("[CMD] Relay1 ON blocked — lockout active\r\n");
                else if (r1 == 1 && is_volt_fault())
                    Debug_Print("[CMD] Relay1 ON blocked — voltage fault\r\n");
                else
                {
                    char cmd_src[16] = "";
                    extract_str(json, "src", cmd_src, sizeof(cmd_src));
                    bool prev1 = relay1;
                    Relay1_Set(r1 == 1);
                    if (relay1 != prev1) {
                        log_relay_event(1, relay1, cmd_src[0] ? cmd_src : "manual");
                        publish_status();
                    }
                    Debug_Print(r1 ? "[CMD] Relay1 ON\r\n" : "[CMD] Relay1 OFF\r\n");
                }
            }
            /* relay3 / relay4 — forwarded via LoRa to slave Blue Pill
             * pump/01/cmd {"relay3":1}  → slave P1 ON  (pump03)
             * pump/01/cmd {"relay4":1}  → slave P2 ON  (pump04) */
            int r3 = extract_int(json, "relay3");
            if (r3 >= 0) {
                LoRa_SendRelay(1, r3 == 1);
                if (mains_is_off) {
                    mains_restore_slave = (r3 == 1);
                    noinit_mains_slave  = (r3 == 1) ? 1U : 0U;
                }
                Debug_Print(r3 ? "[CMD] LoRa P1 ON\r\n" : "[CMD] LoRa P1 OFF\r\n");
            }
            int r4 = extract_int(json, "relay4");
            if (r4 >= 0) {
                LoRa_SendRelay(2, r4 == 1);
                if (mains_is_off) {
                    mains_restore_slave = (r4 == 1);
                    noinit_mains_slave  = (r4 == 1) ? 1U : 0U;
                }
                Debug_Print(r4 ? "[CMD] LoRa P2 ON\r\n" : "[CMD] LoRa P2 OFF\r\n");
            }
            return;
        }
        /* Plain URL payload on next line (non-JSON bridge format). */
        {
            char ota_url[200];
            if (extract_ota_url_any(line, ota_url, sizeof(ota_url)))
            {
                recv_payload_pending = false;
                modem_ota_start(ota_url, 0);
                return;
            }
        }
        /* "OK" ends an AT+QMTRECV exchange with no usable payload — clear flag */
        if (strcmp(line, "OK") == 0)
            recv_payload_pending = false;
        /* Other lines (e.g. +QMTRECV header) — keep waiting, fall through */
    }

    if (strstr(line, "+QMTRECV:"))
    {
        char *json = strchr(line, '{');
        if (json)
        {
            /* Settings topic inline: check topic in the +QMTRECV line */
            if (strstr(line, TOPIC_SETTINGS))
            {
                apply_settings(json);
                return;
            }
            if (strstr(line, TOPIC_SETTINGS2))
            {
                apply_settings2(json);
                return;
            }
            /* LoRa OTA trigger inline: {"url":"https://..."} on lora_ota topic */
            if (strstr(line, TOPIC_LORA_OTA))
            {
                char lora_url[200];
                if (extract_str(json, "url", lora_url, sizeof(lora_url)))
                    LoRaOta_Start(lora_url);
                return;
            }
            /* OTA command: {"url":"https://...","crc32":"AABBCCDD"} */
            char ota_url[200];
            if (extract_str(json, "url", ota_url, sizeof(ota_url)))
            {
                if (ota_retry_blocked()) {
                    Debug_Print("[OTA] Ignored trigger (cooldown after reboot)\r\n");
                    return;
                }
                char crc_str[12] = {0};
                uint32_t ref_crc = 0;
                if (extract_str(json, "crc32", crc_str, sizeof(crc_str)))
                    ref_crc = (uint32_t)strtoul(crc_str, NULL, 16);
                modem_ota_start(ota_url, ref_crc);
                return;
            }
            /* Inline payload — check if pump/02/cmd (relay1→physical relay2) */
            if (strstr(line, TOPIC_CMD2))
            {
                int r = extract_int(json, "relay1");
                if (r >= 0)
                {
                    char cmd_src[16] = "";
                    extract_str(json, "src", cmd_src, sizeof(cmd_src));
                    if (r == 1 && relay1) {
                        Debug_Print("[CMD] Relay2 ON blocked — relay1 active\r\n");
                        return;
                    }
                    if (r == 1 && is_volt_fault()) {
                        Debug_Print("[CMD] Relay2 ON blocked — voltage fault\r\n");
                        return;
                    }
                    if (r == 1 && HAL_GetTick() < lockout_until2) {
                        Debug_Print("[CMD] Relay2 ON blocked — lockout active\r\n");
                        return;
                    }
                    bool prev2 = relay2;
                    Relay2_Set(r == 1);
                    if (relay2 != prev2) {
                        log_relay_event(2, relay2, cmd_src[0] ? cmd_src : "manual");
                        publish_status2();
                    }
                }
            }
            else
            {
                int r1 = extract_int(json, "relay1");
                if (r1 >= 0)
                {
                    if (r1 == 1 && relay2)
                        Debug_Print("[CMD] Relay1 ON blocked — relay2 active\r\n");
                    else if (r1 == 1 && HAL_GetTick() < lockout_until)
                        Debug_Print("[CMD] Relay1 ON blocked — lockout active\r\n");
                    else if (r1 == 1 && is_volt_fault())
                        Debug_Print("[CMD] Relay1 ON blocked — voltage fault\r\n");
                    else
                    {
                        char cmd_src[16] = "";
                        extract_str(json, "src", cmd_src, sizeof(cmd_src));
                        bool prev1 = relay1;
                        Relay1_Set(r1 == 1);
                        if (relay1 != prev1) {
                            log_relay_event(1, relay1, cmd_src[0] ? cmd_src : "manual");
                            publish_status();
                        }
                        Debug_Print(r1 ? "[CMD] Relay1 ON\r\n" : "[CMD] Relay1 OFF\r\n");
                    }
                }
            }
        }
        else
        {
            /* Inline non-JSON payload with URL in the same +QMTRECV line. */
            char ota_url[200];
            if (extract_ota_url_any(line, ota_url, sizeof(ota_url)))
            {
                modem_ota_start(ota_url, 0);
                return;
            }
            /* Plain-text RESET on cmd topic */
            if ((strstr(line, TOPIC_CMD) || strstr(line, TOPIC_CMD2)) &&
                strstr(line, "RESET")) {
                Debug_Print("[CMD] MQTT reset — rebooting\r\n");
                bkup_clear_reset_count();
                IWDG->KR = 0xAAAAU;
                NVIC_SystemReset();
            }
        }
        if (strchr(line, '"'))
        {
            /* Has quoted topic but no '{': response header from AT+QMTRECV.
             * Payload arrives on the next line — store topic for dispatch.  */
            recv_payload_pending = true;
            /* Extract topic name from: +QMTRECV: 0,0,"pump/01/settings",N  */
            const char *tq = strchr(line, '"');
            if (tq)
            {
                tq++;
                size_t ti = 0;
                while (*tq && *tq != '"' && ti < sizeof(recv_pending_topic) - 1)
                    recv_pending_topic[ti++] = *tq++;
                recv_pending_topic[ti] = '\0';
            }
        }
        else
        {
            /* Buffer-mode notification: "+QMTRECV: 0,<id>" — no topic, no
             * payload.  EC200U has buffered the message; request it now.   */
            const char *p = strchr(line, ',');
            if (p)
            {
                int msgid = atoi(p + 1);
                char recv_cmd[32];
                snprintf(recv_cmd, sizeof(recv_cmd), "AT+QMTRECV=0,%d", msgid);
                modem_cmd(recv_cmd);
                recv_payload_pending = true;
                recv_pending_topic[0] = '\0'; /* topic unknown in buffer-mode */
            }
        }
        return;
    }

    /* +CCLK: response to AT+CCLK? — sync network real time */
    if (strstr(line, "+CCLK:")) { parse_cclk_line(line); return; }

    /* +QMTSTAT: server closed the connection.
     * IGNORE in early states (NET_WAIT→SUBSCRIBING) — it is a stale URC from
     * a previous AT+QMTCLOSE that arrived late.  Only act when we have a live
     * MQTT session (CONNECTED / PUBLISHING / PUB_WAIT_OK).                   */
    if (strstr(line, "+QMTSTAT:"))
    {
        if (mqtt_state == MQTT_STATE_CONNECTED ||
            mqtt_state == MQTT_STATE_PUBLISHING ||
            mqtt_state == MQTT_STATE_PUB_WAIT_OK)
        {
            Debug_Print("[MQTT] Disconnected (QMTSTAT)\r\n");
            blink_n(7); /* 7 blinks = server dropped connection unexpectedly */
            pub_pending = false;
            recv_payload_pending = false;
            mqtt_state = MQTT_STATE_DISCONNECTED;
        }
        /* else: ignore — stale URC from previous QMTCLOSE */
        return;
    }

    /* +CMTI: "SM",<index> — new SMS arrived; schedule read in Modem_Process */
    if (strstr(line, "+CMTI:"))
    {
        const char *p = strrchr(line, ',');
        if (p)
        {
            sms_index   = atoi(p + 1);
            sms_pending = true;
            Debug_Print("[SMS] New SMS — queued for read\r\n");
        }
        return;
    }

    /* +CSQ: <rssi>,<ber>  — signal quality response */
    if (strstr(line, "+CSQ:"))
    {
        int rssi = 99;
        const char *p = strchr(line, ':');
        if (p)
        {
            p++;
            while (*p == ' ')
                p++;
            rssi = atoi(p);
        }
        if (rssi < 0 || rssi > 31) rssi = 99; /* sanitize */
        last_rssi = (int8_t)rssi;
        return;
    }

    switch (mqtt_state)
    {

