Vimalananth/STM32-EC200-Firmware/src/modem.c
    char lb[80]; int lp = 0;
    uint32_t t0 = HAL_GetTick();
    while (HAL_GetTick() - t0 < 5000)
    {
        IWDG->KR = 0xAAAAU;
        uint8_t b;
        if (HAL_UART_Receive(modem_uart, &b, 1, 100) != HAL_OK) continue;
        if (b == '\r') continue;
        if (b == '\n')
        {
            lb[lp] = '\0';
            if (lp > 0)
            {
                if (strstr(lb, "+CMGL:"))
                {
                    /* +CMGL: <idx>,"REC UNREAD",... — extract index */
                    const char *p = lb + 6;
                    while (*p == ' ') p++;
                    int idx = atoi(p);
                    if (idx > 0 && !sms_pending)
                    { sms_index = idx; sms_pending = true; }
                }
                else if (strcmp(lb, "OK") == 0 || strcmp(lb, "ERROR") == 0)
                    break;
            }
            lp = 0;
        }
        else if (lp < (int)sizeof(lb) - 1)
            lb[lp++] = (char)b;
    }
    rxpos = 0;
}

/* Send an AT command and wait for an OK response.
 * Retries are used in Modem_Init because EC200U can still be settling
 * for a short time after CFUN reset during post-OTA reboot. */
static bool modem_sync_cmd_ok(const char *cmd, uint32_t timeout_ms, uint8_t retries)
{
    for (uint8_t i = 0; i < retries; i++) {
        modem_cmd(cmd);
        if (modem_sync_expect("OK", timeout_ms))
            return true;
        HAL_Delay(300);
        IWDG->KR = 0xAAAAU;  /* direct kick — safe before MX_IWDG_Init */
    }
    return false;
}

static bool modem_is_exact_reboot_urc(const char *line)
{
    if (!line || !line[0]) return false;
    if (strcmp(line, "RDY") == 0) return true;
    if (strcmp(line, "+CFUN: 1") == 0) return true;
    return false;
}

static bool modem_extract_host(const char *url, char *host, size_t host_sz)
{
    const char *p = strstr(url, "://");
    const char *start = p ? (p + 3) : url;
    size_t i = 0;
    if (!host || host_sz < 2 || !start || *start == '\0')
        return false;
    while (start[i] &&
           start[i] != '/' &&
           start[i] != ':' &&
           start[i] != '?' &&
           start[i] != '#' &&
           i < (host_sz - 1U))
    {
        host[i] = start[i];
        i++;
    }
    host[i] = '\0';
    return i > 0;
}

/* ── OTA trigger helper — re-applies HTTP config before each download ────── */
static void modem_ota_start(const char *url, uint32_t expected_crc32)
{
    char ota_host[96] = {0};
    bool have_ota_host = modem_extract_host(url, ota_host, sizeof(ota_host));
    /* Central cooldown guard: block OTA retrigger after modem reboot during OTA. */
    if (ota_retry_blocked()) {
        Debug_Print("[OTA] Trigger ignored (cooldown active)\r\n");
        queue_publish(TOPIC_OTA_STATUS,
                      "{\"ota_status\":\"error\",\"reason\":\"ota cooldown active\"}");
        return;
    }
    if (ota_error_msg[0] != '\0') {
        Debug_Print("[OTA] Trigger ignored while OTA result publish is pending\r\n");
        return;
    }

    /* ── PHASE 1: everything done while MQTT is still connected ──────────────
     *
     * Key insight: AT+QHTTPURL only stores the URL in RAM — it does NOT start
     * a TLS handshake or any network activity.  The TLS/TCP connection only
     * happens later during AT+QHTTPGET.
     *
     * By doing SSL config, QHTTPCFG, and QHTTPURL while MQTT is connected, any
     * failure (ERROR / timeout) can be published to Firebase immediately via the
     * live MQTT connection — no reconnect cycle needed.
     *
     * AT+QHTTPGET is the only command that cannot coexist with MQTT TLS
     * (EC200U cannot run two simultaneous TLS sessions), so MQTT disconnect
     * is deferred until just before AT+QHTTPGET.                            */

    /* Publish "starting" — tells bridge.js to clear the retained OTA message
     * on pump/01/ota so the board doesn't re-trigger OTA on every reconnect. */
    /* Publish "starting" even if a status heartbeat is mid-flight.
     * The retained pump/01/ota message often arrives while mqtt_state is
     * PUBLISHING or PUB_WAIT_OK (connection heartbeat queued immediately on
     * CONNECTED).  Wait 700 ms for the in-progress publish to complete, then
     * flush stale modem bytes before sending our own AT+QMTPUBEX.            */
    if (mqtt_state == MQTT_STATE_CONNECTED  ||
        mqtt_state == MQTT_STATE_PUBLISHING ||
        mqtt_state == MQTT_STATE_PUB_WAIT_OK) {
        HAL_Delay(700);                        /* let previous publish finish */
        HAL_IWDG_Refresh(&hiwdg);
        { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }

        const char *ota_payload = "{\"ota_status\":\"starting\"}";
        char pub_cmd[80];
        snprintf(pub_cmd, sizeof(pub_cmd),
                 "AT+QMTPUBEX=0,0,0,0,\"" TOPIC_OTA_STATUS "\",%d",
                 (int)strlen(ota_payload));
        modem_cmd(pub_cmd);
        uint8_t c;
        uint32_t t0 = HAL_GetTick();
        bool got_prompt = false;
        while (HAL_GetTick() - t0 < 3000) {
            if (HAL_UART_Receive(modem_uart, &c, 1, 5) == HAL_OK && c == '>') {
                got_prompt = true; break;
            }
        }
        if (got_prompt) {
            HAL_UART_Transmit(modem_uart, (uint8_t*)ota_payload,
                              strlen(ota_payload), 1000);
            uint8_t ctrlz = 0x1A;  /* Ctrl-Z commits the MQTT publish */
            HAL_UART_Transmit(modem_uart, &ctrlz, 1, 1000);
            HAL_Delay(500);        /* wait for modem to process publish */
            /* Flush +QMTPUBEX response so it doesn't interfere with SSL cmds */
            { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }
        }
        HAL_IWDG_Refresh(&hiwdg);
    }

    /* SSL context 1 — used by HTTP client (independent of context 0 = MQTT).
     * Re-applied here because AT+QIDEACT (from a previous reconnect) resets
     * QSSLCFG RAM settings.                                                 */
    modem_cmd("AT+QSSLCFG=\"sslversion\",1,4");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"seclevel\",1,0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    /* EC200U HTTPS servers behind CDN (e.g., GitHub raw) typically require
     * TLS SNI and can reject handshake when modem RTC is stale. */
    if (have_ota_host) {
        char sni_cmd[160];
        snprintf(sni_cmd, sizeof(sni_cmd), "AT+QSSLCFG=\"sni\",1,\"%s\"", ota_host);
        modem_cmd(sni_cmd);
    } else {
        modem_cmd("AT+QSSLCFG=\"sni\",1,1");
    }
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"ignorelocaltime\",1,1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"contextid\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"sslctxid\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    /* Without "ssl",1 the HTTP client uses plain TCP even for https:// URLs.
     * The TLS handshake never happens and GitHub returns a connection error. */
    modem_cmd("AT+QHTTPCFG=\"ssl\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd(OTA_HTTP_REDIRECT_ENABLED ? "AT+QHTTPCFG=\"redirect\",1"
                                        : "AT+QHTTPCFG=\"redirect\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"responseheader\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"requestheader\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);

    /* Stop any lingering HTTP session and delete any leftover file from a
     * previous failed OTA attempt.  AT+QHTTPGET auto-saves the response to
     * "HTTP_GETFILE" on EC200U UFS (no drive prefix).  Delete it first so
     * stale content cannot be flashed if a previous download was incomplete.
     * Errors from both commands are ignored. */
    modem_cmd("AT+QHTTPSTOP");
    HAL_Delay(500);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QFDEL=\"HTTP_GETFILE\"");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }
    HAL_IWDG_Refresh(&hiwdg);

    /* Set URL.  Use a 5-second input window so the modem exits URL-input mode
     * before modem_sync_expect (10 s) returns — keeps the modem in a clean
     * command-mode state on failure.                                         */
    char urlcmd[32];
    snprintf(urlcmd, sizeof(urlcmd), "AT+QHTTPURL=%d,5", (int)strlen(url));
    modem_cmd(urlcmd);

