Vimalananth/STM32-EC200-Firmware/src/modem.c
    if (!modem_sync_expect("CONNECT", 10000)) {
        /* URL setup failed — MQTT is still connected.  Publish error directly
         * via queue_publish so it appears in Firebase within seconds.
         * No reconnect needed; just return and let the main loop resume.    */
        char errbuf[80];
        snprintf(errbuf, sizeof(errbuf),
                 "{\"ota_status\":\"error\",\"reason\":\"no CONNECT: %s\"}", modem_last_resp);
        pub_pending = false;
        queue_publish(TOPIC_OTA_STATUS, errbuf);
        return;   /* MQTT still connected — normal operation resumes         */
    }

    /* Send URL bytes (no \r\n — modem counts exact bytes) */
    Modem_Send(url);
    HAL_IWDG_Refresh(&hiwdg);

    if (!modem_sync_expect("OK", 10000)) {
        char errbuf[80];
        snprintf(errbuf, sizeof(errbuf),
                 "{\"ota_status\":\"error\",\"reason\":\"URL rejected: %s\"}", modem_last_resp);
        pub_pending = false;
        queue_publish(TOPIC_OTA_STATUS, errbuf);
        return;   /* MQTT still connected                                    */
    }
    HAL_IWDG_Refresh(&hiwdg);

    /* ── PHASE 2: disconnect MQTT, full modem reset, restart download ───────
     *
     * Problem: AT+QFOPEN is silently ignored after a previous failed QFOPEN
     * attempt.  The EC200U's UFS file system mutex gets stuck and the only
     * command that clears it is AT+CFUN=1,1 (full modem software reset).
     * QIDEACT+QIACT frees TLS RAM (fixes 729) but does NOT clear the FS
     * mutex.  CFUN=1,1 fixes both.
     *
     * Since CFUN=1,1 wipes all modem config (SSL, HTTP, URL), we call
     * OTA_Start() instead of OTA_StartFromGet() so the state machine
     * re-applies SSL context and URL from scratch on the clean modem.      */
    modem_cmd("AT+QMTDISC=0");
    HAL_Delay(500);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QMTCLOSE=0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);

    Debug_Print("[OTA] CFUN=1,1 — full modem reset to clear UFS/TLS state\r\n");
    modem_cmd("AT+CFUN=1,1");
    modem_sync_expect("RDY", 30000);          /* wait up to 30 s for modem  */
    IWDG->KR = 0xAAAAU;
    for (int _i = 0; _i < 30; _i++) {        /* 15 s: SIM CPIN + network   */
        HAL_Delay(500); IWDG->KR = 0xAAAAU;
    }
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 200) == HAL_OK) {} }
    IWDG->KR = 0xAAAAU;

    modem_sync_cmd_ok("ATE0", 2000, 5);       /* disable echo after reset   */

    /* Reactivate PDP context — retry up to 3× in case network not ready   */
    for (int _a = 0; _a < 3; _a++) {
        modem_cmd("AT+QIACT=1");
        if (modem_sync_expect("OK", 15000)) break;
        for (int _i = 0; _i < 6; _i++) {     /* 3 s between retries        */
            HAL_Delay(500); IWDG->KR = 0xAAAAU;
        }
    }
    modem_sync_cmd_ok("AT+QIDNSCFG=1,\"8.8.8.8\",\"8.8.4.4\"", 3000, 2);
    HAL_IWDG_Refresh(&hiwdg);

    /* Re-sync parser and configure HTTP/TLS synchronously after CFUN reset.
     * This avoids async SSL state races right after reboot. */
    if (!modem_sync_cmd_ok("AT", 2000, 8))
        Debug_Print("[OTA] WARN: AT sync before OTA HTTP cfg failed\r\n");
    modem_sync_cmd_ok("ATE0", 2000, 3);
    HAL_Delay(300); IWDG->KR = 0xAAAAU;

    modem_sync_cmd_ok("AT+QSSLCFG=\"sslversion\",1,4", 3000, 3);
    modem_sync_cmd_ok("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF", 3000, 3);
    modem_sync_cmd_ok("AT+QSSLCFG=\"seclevel\",1,0", 3000, 3);
    if (have_ota_host) {
        char sni_cmd2[160];
        snprintf(sni_cmd2, sizeof(sni_cmd2), "AT+QSSLCFG=\"sni\",1,\"%s\"", ota_host);
        modem_sync_cmd_ok(sni_cmd2, 3000, 3);
    } else {
        modem_sync_cmd_ok("AT+QSSLCFG=\"sni\",1,1", 3000, 3);
    }
    modem_sync_cmd_ok("AT+QSSLCFG=\"ignorelocaltime\",1,1", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"contextid\",1", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"sslctxid\",1", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"ssl\",1", 3000, 3);
    modem_sync_cmd_ok(OTA_HTTP_REDIRECT_ENABLED ? "AT+QHTTPCFG=\"redirect\",1"
                                                : "AT+QHTTPCFG=\"redirect\",0",
                     3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"responseheader\",0", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"requestheader\",0", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPSTOP", 3000, 2);
    modem_cmd("AT+QFDEL=\"HTTP_GETFILE\"");  /* may fail if file absent */
    HAL_Delay(300); IWDG->KR = 0xAAAAU;
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 100) == HAL_OK) {} }

    /* Set URL synchronously, then jump OTA state machine to QHTTPGET. */
    {
        char urlcmd2[32];
        snprintf(urlcmd2, sizeof(urlcmd2), "AT+QHTTPURL=%d,5", (int)strlen(url));
        modem_cmd(urlcmd2);
        if (!modem_sync_expect("CONNECT", 10000)) {
            queue_publish(TOPIC_OTA_STATUS,
                          "{\"ota_status\":\"error\",\"reason\":\"no CONNECT (post-cfun)\"}");
            return;
        }
        Modem_Send(url);
        if (!modem_sync_expect("OK", 10000)) {
            queue_publish(TOPIC_OTA_STATUS,
                          "{\"ota_status\":\"error\",\"reason\":\"URL reject (post-cfun)\"}");
            return;
        }
    }

    mqtt_state = MQTT_STATE_DISCONNECTED;
    HAL_IWDG_Refresh(&hiwdg);

    /* Switch to 9600 baud for reliable OTA binary streaming.
     * At 115200: ~11.5 bytes arrive per 1ms flash write → FIFO overflows → CRC mismatch.
     * At   9600: ~0.96 bytes per 1ms flash write → no overflow → reliable stream.
     * AT+IPR=115200 in OTA_ST_REBOOT restores EC200U baud before STM32 reset.
     * MX_USART1_UART_Init() in the new firmware restores STM32 UART to 115200. */
    modem_cmd("AT+IPR=9600");
    if (modem_sync_expect("OK", 3000)) {
        HAL_Delay(50);
        modem_uart->Init.BaudRate = 9600;
        HAL_UART_Init(modem_uart);
        HAL_Delay(50);
        { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 100) == HAL_OK) {} }
        Debug_Print("[OTA] UART switched to 9600 baud\r\n");
    } else {
        Debug_Print("[OTA] WARN: AT+IPR=9600 failed — streaming at 115200\r\n");
    }

