Vimalananth/STM32-EC200-Firmware/src/modem.c
    /* URL + HTTP config are already set above; start directly from GET. */
    OTA_SetExpectedCRC(expected_crc32);
    OTA_StartFromGet(url);
}

/* ── OTA publish callback — lets ota.c publish via MQTT ─────────────────── */
static void modem_ota_publish(const char *topic, const char *payload)
{
    (void)topic;  /* topic always TOPIC_OTA_STATUS — matches ota_error_msg path */

    /* Only save meaningful OTA status updates to ota_error_msg so they
     * survive MQTT disconnect+reconnect.  Skip ota_debug trace lines —
     * they are published for every received AT line during download and
     * would clobber the real error/success status before MQTT reconnects.*/
    if (strstr(payload, "\"ota_status\"")) {
        strncpy(ota_error_msg, payload, sizeof(ota_error_msg) - 1);
        ota_error_msg[sizeof(ota_error_msg) - 1] = '\0';
    }

    if (strstr(payload, "modem rebooted during ota")) {
        ota_retry_block_until = HAL_GetTick() + OTA_RETRY_BLOCK_MS;
        Debug_Print("[OTA] Cooldown armed after modem reboot during OTA\r\n");
    }

    pub_pending = false;
    queue_publish(TOPIC_OTA_STATUS, payload);
}

/* ── LoRa OTA publish callback — lets lora_ota.c publish via MQTT ──────── */
static void modem_lora_ota_publish(const char *topic, const char *payload)
{
    pub_pending = false;
    queue_publish(topic, payload);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Modem_Init  — called once from main.c after UART init
 * ═══════════════════════════════════════════════════════════════════════════ */

void Modem_Init(UART_HandleTypeDef *huart)
{
    modem_uart = huart;

    /* Enable the STM32G0 8-byte RX FIFO so bytes received during a flash
     * write stall (86–200 µs) are buffered instead of triggering ORE.
     * With FIFO disabled only 1 byte fits in RDR; at 115200 baud the next
     * byte arrives ~87 µs later, causing silent data corruption during OTA.
     * Threshold = 1/8 (1 byte) keeps RXNE behaviour identical to no-FIFO. */
    HAL_UARTEx_EnableFifoMode(modem_uart);
    HAL_UARTEx_SetRxFifoThreshold(modem_uart, UART_RXFIFO_THRESHOLD_1_8);

    rxpos = 0;
    mqtt_state = MQTT_STATE_BOOT;
    state_entered_ms = HAL_GetTick();

    /* Restore relay state from Flash before anything else — ensures latching
     * relays are driven to match their last known position on every reboot. */
    RelayState_Load();

    /* Restore protection settings from Flash so correct thresholds are active
     * from the first protection cycle, before Firebase re-delivers settings. */
    Settings_Load();

    Debug_Print("\r\n=== EC200U MQTT Pump Controller ===\r\n");
    Debug_Print("[MODEM] Pump ID : " PUMP_ID "\r\n");
    Debug_Print("[MODEM] Broker  : " BROKER_HOST "\r\n");
    Debug_Print("[MODEM] Waiting for EC200U ready...\r\n");

    /* Detect software reset (NVIC_SystemReset after OTA) vs cold power-on.
     * RCC_CSR_SFTRSTF is set by NVIC_SystemReset; PORRSTF is set on power-on.
     * Used below to choose the initial MQTT state. */
    uint32_t reset_csr = RCC->CSR;
    bool ota_reboot = ((reset_csr & RCC_CSR_SFTRSTF) != 0) && OTA_WasRebootPending();
    {
        char dbg[96];
        snprintf(dbg, sizeof(dbg), "[MODEM] Reset CSR: 0x%08lX\r\n", (unsigned long)reset_csr);
        Debug_Print(dbg);
    }
    modem_log_reset_flags(reset_csr);
    RCC->CSR |= RCC_CSR_RMVF;   /* clear reset-cause flags for next check */

    /* MQTT backoff counter — noinit RAM survives NVIC_SystemReset() but not
     * power-off (RAM loses state).  On any non-software reset the magic pair
     * will be invalid so bkup_get_reset_count() returns 0 automatically.
     * Explicitly clear on non-software reset for reliability.              */
    if (!(reset_csr & RCC_CSR_SFTRSTF))
        bkup_clear_reset_count();
    mqtt_reset_count = bkup_get_reset_count();
    {
        char dbg[48];
        snprintf(dbg, sizeof(dbg), "[MQTT] backoff reset count: %u/%u\r\n",
                 (unsigned)mqtt_reset_count, (unsigned)MQTT_WD_MAX_RESETS);
        Debug_Print(dbg);
    }

    if (ota_reboot) {
        /* Signal DISCONNECTED reconnect to fire nuclear CFUN after 1 failure
         * instead of 5 — makes MQTT reconnect in ~2-4 min rather than ~10. */
        ota_first_reconnect = true;
        disconnected_count  = 0;
        /* Check OTA flags to determine if the bootloader applied the update.
         * Bootloader erases the flags page (all bytes → 0xFF) after a
         * successful App B → App A copy.  If the flags magic is still
         * OTA_MAGIC the bootloader CRC check failed and old App A is kept.  */
        volatile uint32_t *flags_magic = (volatile uint32_t*)OTA_FLAGS_ADDR;
        if (*flags_magic == 0xFFFFFFFFUL) {
            /* Erased flags = bootloader ran + copy succeeded → new firmware */
            strncpy(ota_error_msg, "{\"ota_status\":\"success\"}",
                    sizeof(ota_error_msg) - 1);
            ota_error_msg[sizeof(ota_error_msg) - 1] = '\0';
            Debug_Print("[OTA] New firmware running — will publish success\r\n");
        } else {
            /* Flags still present = bootloader CRC check failed, old App A kept */
            strncpy(ota_error_msg, "{\"ota_status\":\"error\",\"reason\":\"crc_fail\"}",
                    sizeof(ota_error_msg) - 1);
            ota_error_msg[sizeof(ota_error_msg) - 1] = '\0';
            Debug_Print("[OTA] Post-OTA: bootloader CRC fail — old firmware kept\r\n");
        }
        /* No CFUN here — nuclear CFUN in DISCONNECTED (threshold=0) fires on
         * the first MQTT failure and is the proven-reliable place to clear
         * the EC200U TLS heap.  Doing CFUN in Modem_Init caused 2×60s waits
         * on APP RDY timeout and still didn't prevent BROKER_OPEN failure.
         * With ota_first_reconnect=true and nuclear_threshold=0, the nuclear
         * CFUN fires immediately on the first DISCONNECTED and calls
         * Modem_Init again with a clean modem. */
        Debug_Print("[MODEM] OTA reboot — skipping CFUN, nuclear will clear TLS on first failure\r\n");
        /* 5 s settle: same as cold boot, enough for AT commands */
        for (int i = 0; i < 10; i++) { HAL_Delay(500); IWDG->KR = 0xAAAAU; }
    } else {
        /* Cold boot — EC200U powers on and takes ~5 s before it accepts AT. */
        for (int i = 0; i < 10; i++) { HAL_Delay(500); IWDG->KR = 0xAAAAU; }
    }
    if (!modem_sync_cmd_ok("AT", 2000, 15))
        Debug_Print("[MODEM] WARN: AT sync failed, continuing\r\n");
    /* Restore factory defaults so any stale NVRAM settings (e.g. a bad
     * AT+CNMI value written during previous abnormal operation) do not
     * persist across power cycles.  All required settings are re-applied
     * explicitly below, so AT&F here is safe.  Must run before ATE0 so
     * echo is disabled again after the factory reset re-enables it.      */
    modem_sync_cmd_ok("AT&F", 2000, 3);
    if (!modem_sync_cmd_ok("ATE0", 2000, 5))
        Debug_Print("[MODEM] WARN: ATE0 failed, continuing\r\n");
    /* Lock CEREG URC mode to 0 so AT+CEREG? always returns "+CEREG: 0,<stat>".
     * After an OTA reboot the modem may retain mode=1 or 2 from a previous
     * session, changing the response format and preventing NET_WAIT from
     * recognising the registration status.                                   */
    if (!modem_sync_cmd_ok("AT+CEREG=0", 2000, 5))
        Debug_Print("[MODEM] WARN: CEREG mode set failed, continuing\r\n");

    /* Route all URCs to UART1 (the MCU interface).  EC200U NVRAM can store
     * "usbmodem" here if USB was ever connected during factory test, which
     * silently redirects +CMTI (and all other URCs) away from the MCU.    */
    modem_sync_cmd_ok("AT+QURCCFG=\"urcport\",\"uart1\"", 2000, 3);

    /* SMS text mode, +CMTI URC on new message.
     * Delete only already-read messages (flag=1); flag=4 would wipe unread
     * SMS that arrived during the CFUN reboot window before sms_process()
     * could read them.  sms_process() deletes each message after reading.  */
    modem_sync_cmd_ok("AT+CMGF=1", 2000, 3);
    modem_sync_cmd_ok("AT+CNMI=2,1,0,0,0", 2000, 3);
    modem_sync_cmd_ok("AT+CMGD=1,1", 3000, 3);  /* 1=read only, not unread */
    IWDG->KR = 0xAAAAU;

    /* SSL context 1 — used by HTTP client for HTTPS OTA downloads.
     * Must be separate from context 0 (MQTT) so the broker SNI doesn't
     * interfere with GitHub/CDN TLS handshake.                             */
    modem_cmd("AT+QSSLCFG=\"sslversion\",1,4");
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF");
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"seclevel\",1,0");   /* no cert verify for testing */
    HAL_Delay(300);
    /* HTTP client: use SSL context 1, follow GitHub → CDN redirects */
    modem_cmd("AT+QHTTPCFG=\"sslctxid\",1");
    HAL_Delay(300);
    modem_cmd("AT+QHTTPCFG=\"redirect\",1");
    HAL_Delay(300);

    IWDG->KR = 0xAAAAU;   /* ~3 s elapsed since last pet — refresh before long delays */

