Vimalananth/STM32-EC200-Firmware/src/modem.c
    /* ── periodic tasks (only when fully connected) ── */
    if (mqtt_state == MQTT_STATE_CONNECTED && !OTA_IsActive() && !LoRaOta_IsActive())
    {

        /* Network time sync — request AT+CCLK? once after connect, then every 6h */
        if (!pub_pending &&
            (cclk_needed ||
             (last_cclk_ms && HAL_GetTick() - last_cclk_ms >= CCLK_RESYNC_MS)))
        {
            cclk_needed = false;
            modem_cmd("AT+CCLK?");
        }

        /* Deferred pump02 status — send as soon as the queue is free */
        if (pub_status2_needed && !pub_pending)
        {
            pub_status2_needed = false;
            publish_status2();
        }

        /* Deferred line2 status (after keepalive or relay/online transition) */
        if (pub_line2_needed && !pub_pending)
        {
            pub_line2_needed = false;
            publish_line2_status();
        }

        /* Deferred pump2 voltage log (same data as pump1, just different topic) */
        if (pub_vlog2_needed && !pub_pending)
        {
            pub_vlog2_needed = false;
            publish_vlog_for(TOPIC_VLOG2);
        }

        /* publish on state change — relay or dry-run trip changed */
        if (!pub_pending &&
            (relay1 != prev_relay1 || relay2 != prev_relay2 ||
             dry_run_tripped != prev_dry_run_trip))
        {
            bool relay2_changed = (relay2 != prev_relay2);
            prev_relay1       = relay1;
            prev_relay2       = relay2;
            prev_dry_run_trip = dry_run_tripped;
            publish_status();
            if (relay2_changed) pub_status2_needed = true; /* deferred — queue busy */
        }

        /* 10-min keepalive — online:true for all pumps */
        if (HAL_GetTick() - last_heartbeat_ms >= STATUS_KEEPALIVE_MS)
        {
            last_heartbeat_ms = HAL_GetTick();
            modem_cmd("AT+CSQ"); /* refresh signal strength; +CSQ updates last_rssi */
            publish_status();
            pub_status2_needed = true;  /* deferred — queue busy after publish_status() */
            pub_line2_needed   = true;  /* deferred — line2 keepalive after line1       */
        }

        /* Event-driven line2: publish immediately on relay3 state change */
        if (!pub_pending)
        {
            int cur_r3 = LoRa_GetRelay3State();
            if (cur_r3 != prev_lora_r3_pub && cur_r3 != -1)
            {
                prev_lora_r3_pub = cur_r3;
                publish_line2_status();
            }
        }

        /* Event-driven line2: alert + status on slave online/offline transition */
        if (!pub_pending)
        {
            uint32_t age_raw  = LoRa_GetLastRcvAge();
            bool slave_now    = !(age_raw == 0xFFFFFFFFUL || age_raw / 1000U > 120U);
            if (slave_now != prev_slave_online)
            {
                prev_slave_online = slave_now;
                uint64_t ts = Modem_GetUnixMs();
                char alert[72];
                if (ts)
                    snprintf(alert, sizeof(alert),
                             "{\"event\":\"%s\",\"ts\":%lu}",
                             slave_now ? "slave_online" : "slave_offline",
                             (unsigned long)(ts / 1000ULL));
                else
                    snprintf(alert, sizeof(alert),
                             "{\"event\":\"%s\"}",
                             slave_now ? "slave_online" : "slave_offline");
                queue_publish(TOPIC_LINE2_ALERTS, alert);
                pub_line2_needed = true; /* update status on transition */
            }
        }

        /* 5-min voltage log for line1/pump1 and line1/pump2 (push) */
        static uint32_t vlog_last_ms = 0;
        if (HAL_GetTick() - vlog_last_ms >= VLOG_INTERVAL_MS)
        {
            vlog_last_ms = HAL_GetTick();
            publish_vlog(); /* → TOPIC_VLOG; TOPIC_VLOG2 deferred via pub_vlog2_needed */
        }

        /* 5-min combined log for line2 (relay + flow + Modbus readings) */
        static uint32_t line2_log_last_ms = 0;
        if (HAL_GetTick() - line2_log_last_ms >= VLOG_INTERVAL_MS)
        {
            line2_log_last_ms = HAL_GetTick();
            uint32_t fl_x10 = LoRa_GetFlowLpmX10();
            uint32_t tv_l   = LoRa_GetTotalLitresInt();
            uint64_t ts     = Modem_GetUnixMs();
            char l2log[280];
            int llen = snprintf(l2log, sizeof(l2log),
                         "{\"relay\":%d,\"fl\":%lu.%lu,\"tv\":%lu",
                         (LoRa_GetRelay3State() == 1) ? 1 : 0,
                         (unsigned long)(fl_x10 / 10U),
                         (unsigned long)(fl_x10 % 10U),
                         (unsigned long)tv_l);
            if (LoRa_IsModbusValid() && llen > 0 && llen < (int)sizeof(l2log) - 120)
                llen += snprintf(l2log + llen, sizeof(l2log) - (size_t)llen,
                         ",\"v1\":%ld.%ld,\"v2\":%ld.%ld,\"v3\":%ld.%ld"
                         ",\"i1\":%ld.%02ld,\"i2\":%ld.%02ld,\"i3\":%ld.%02ld"
                         ",\"kw\":%ld.%ld",
                         (long)(LoRa_GetV1x10()  / 10), (long)(LoRa_GetV1x10()  % 10),
                         (long)(LoRa_GetV2x10()  / 10), (long)(LoRa_GetV2x10()  % 10),
                         (long)(LoRa_GetV3x10()  / 10), (long)(LoRa_GetV3x10()  % 10),
                         (long)(LoRa_GetI1x100() / 100),(long)(LoRa_GetI1x100() % 100),
                         (long)(LoRa_GetI2x100() / 100),(long)(LoRa_GetI2x100() % 100),
                         (long)(LoRa_GetI3x100() / 100),(long)(LoRa_GetI3x100() % 100),
                         (long)(LoRa_GetKWx10()  / 10), (long)(LoRa_GetKWx10()  % 10));
            if (ts && llen > 0 && llen < (int)sizeof(l2log) - 25)
                snprintf(l2log + llen, sizeof(l2log) - (size_t)llen,
                         ",\"ts\":%lu}", (unsigned long)(ts / 1000ULL));
            else if (llen > 0 && llen < (int)sizeof(l2log) - 2)
                l2log[llen] = '}', l2log[llen + 1] = '\0';
            queue_publish(TOPIC_LINE2_LOG, l2log);
        }

        /* run protection every 1 s */
        static uint32_t last_prot_ms = 0;
        if (HAL_GetTick() - last_prot_ms >= 1000)
        {
            last_prot_ms = HAL_GetTick();
            run_protection();
        }
    }

    /* ── send OTA error (saved across reconnect) as soon as MQTT is up ── */
    if (ota_error_msg[0] && mqtt_state == MQTT_STATE_CONNECTED)
    {
        pub_pending = false; /* prioritize OTA result over queued heartbeat */
        queue_publish(TOPIC_OTA_STATUS, ota_error_msg);
        ota_error_msg[0] = '\0';
        force_status_after_ota = true;
    }

    if (force_status_after_ota &&
        mqtt_state == MQTT_STATE_CONNECTED &&
        !OTA_IsActive() &&
        !pub_pending)
    {
        modem_cmd("AT+CSQ");
        publish_status();
        force_status_after_ota = false;
    }

